{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":39608497,"authorName":"dph_of_rules","from":"&quot;dph_of_rules&quot; &lt;dph_of_rules@...&gt;","profile":"dph_of_rules","replyTo":"LIST","senderId":"7nZNMdbSgcD5R4oOpa9OpClbOvor49ZyG0Yh-vjy_mYoISjKdNb6I01Lq4BUwsnIuKIGAZlpnYubpSaeU59XeaEYYCdE_5oilQ-UEl-d","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 50 Project: Proposed Storyline","postDate":"1008691458","msgId":1118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDl2bnBlMitnaDYxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDl2bWY3bit0dDJuQGVHcm91cHMuY29tPg=="},"prevInTopic":1117,"nextInTopic":1137,"prevInTime":1117,"nextInTime":1119,"topicId":1111,"numMessagesInTopic":10,"msgSnippet":"I am willing to compromise on the storyline to a certain degree, but I do have a follow-up planned.  The basic plot and follow-up are listed below.","rawEmail":"Return-Path: &lt;dph_of_rules@...&gt;\r\nX-Sender: dph_of_rules@...\r\nX-Apparently-To: gladiator@yahoogroups.com\r\nReceived: (EGP: mail-8_0_1_3); 18 Dec 2001 16:04:22 -0000\r\nReceived: (qmail 22336 invoked from network); 18 Dec 2001 16:04:20 -0000\r\nReceived: from unknown (216.115.97.167)\n  by m10.grp.snv.yahoo.com with QMQP; 18 Dec 2001 16:04:20 -0000\r\nReceived: from unknown (HELO n15.groups.yahoo.com) (216.115.96.65)\n  by mta1.grp.snv.yahoo.com with SMTP; 18 Dec 2001 16:04:21 -0000\r\nReceived: from [216.115.96.127] by n15.groups.yahoo.com with NNFMP; 18 Dec 2001 16:03:58 -0000\r\nDate: Tue, 18 Dec 2001 16:04:18 -0000\r\nTo: gladiator@yahoogroups.com\r\nSubject: Re: 50 Project: Proposed Storyline\r\nMessage-ID: &lt;9vnpe2+gh61@...&gt;\r\nIn-Reply-To: &lt;9vmf7n+tt2n@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 9345\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;dph_of_rules&quot; &lt;dph_of_rules@...&gt;\r\nX-Yahoo-Group-Post: member; u=39608497\r\nX-Yahoo-Profile: dph_of_rules\r\n\r\nI am willing to compromise on the storyline to a certain degree, but I \ndo have a follow-up planned.  The basic plot and follow-up are listed \nbelow.  Admittedly, I was thinking about a season of a tv-series, \nwhere everywhere is pretty much linear.  I do like occasional side \njournies, but I was more concerned about having a plot that works and \nI wanted to leave things so we could have a follow-up.\n\nProposed Storyline for 50 project\n\nEpisode 1: Introduction to the game.  You heard about a city awarding \na contract to guard it.  You and your friends are going to compete to \nwin that contract.\n\nEpisode 2:  You made it to the finals of the competition.\n\nEpisodes 3: You have to defend the city&#39;s trees from foresters who \nwant to chop it down.\n\nEpisode 4:  You have to defend the city&#39;s storehouses from bandits.\n\nEpisode 5:  You have to defend the city&#39;s water supply.\n\nEpisode 6:  You have to defend the city&#39;s gates from destruction.\n\nEpisode 7:  You have to defend the city&#39;s crops from faeries.\n\nEpisodes 8: An invading army tries to besiege the city by keeping \npeople from going and coming to the city.  You go out to meet the \nfrontline defense.\n\nEpisode 9:  You are ambushed from 2 different sides by the invading \narmy.\n\nEpisode 10:  The invading army is getting too close to the city for \nyour comfort.\n\nEpisode 11: The invading army is too powerfull so you have to evacute \nthe citizens from the city.\n\nEpisode 12:  You evacute the citizens into the forest.\n\nEpisode 13: You have to guard the citizens while they sleep in the \nforest.  Note: this will 3-4 civilians surrounded by a fort with \ndoors.\n\nEpisodes 14: You find an entire city occupied by the undead and decide \nto clear out it to make room for the citizens.  First, you have to get \nthrough the outer defenses.\n\nEpisode 15:  You break into the city.\n\nEpisode 16:  You finally remove the undead from the city.\n\nEpisode 17: A group of bandit clerics (who just robbed a bank) return \nto the city to reclaim it.\n\nEpisode 18: You go after the remaining bandit clerics.\n\nEpisodes 19: You decide to return the treasure that the clerics stole. \nUnfortunately, thieves are waiting for you along the way.\n\nEpisode 20: All you have to town, unnoticed to return the gold.  \nUnfortunately, that does not happen.\n\nEpisode 21: You return to the city, after receiving a reward, to find \nthe city taken over.  You have to reconquer it. \n\nEpisode 22:  You have to rescue the citizens held within the city..  \nNote: this will have 2-4 prisoners in a protected cell with gates as \ndoors; they won&#39;t appear until episode 24.\n\nEpisode 23: You increase the defenses of your city while guarding it.\n\nEpisodes 24:  Hearing, that the defenses have weakened, you fight \ntooth-and-nail to reclaim the city you lost in the beginning.\n\nEpisode 25:  You break through the city gates to face the few \nremaining soldiers inside.\n\nEpisode 26: You escort the citizens back to their city while guarding \nthem from hazards of the forest. Note: not a save-the-npc level, only \n2-4 citizens show up.\n\nEpisode 27:  You are almost completely outside the forest, when you \nmeet up with some bandits.  Only that is keeping you from reaching the \ncity is the bandits.  Note: not a save-the-npc level, only 2-4 \ncitizens show up.\n\nEpisode 28: You built a completely underground tunnel connecting the \ntwo cities.  Unfortunately, while digging, you disturb the undead and \norcs.\n\nEpisode 29: You station a small part of your forces in the 2nd city.  \nThe majority of your army runs off to secure a newly nearly abandoned \ncity.  Upon, entering the city you discover lots of clerics and mages.\n\nEpisode 30:  After beating most of the clerics and the mages, you \ndiscover why the people fled: the clerics and mages were raising \nmonsters.\n\nEpisode 31: You venture off to win a contract to protect a fourth \ncity, one with a harbor.\n\nEpisode 32:  Your army surived the preliminary round, but must more \ndifficult teams on a different terrain.\n\nEpisode 33:  Your army has to face one final battle to win the \ncontract; unfortunately, your back is turned towards the sea. \n\nEpisodes 34: On your way back to the city, you are ambushed by men.  \nUnfortunately, these men are using the same tactics you use.\n\nEpisode 35: You had it coming by not screening new members of your \narmy too well.  Someone from within your army has manage to gather 1/3 \nof your forces against you.\n\nEpisode 36:  You have to defeat the last of the traitorous forces.\n\nEpisodes 37: While you are rebuilding your forces, another large \nnumber army approaches to conquer your cities.  You send your men out \nto take out the 1st wave.\n\nEpisode 38:  You hear that the army has fresh supplies at sea.  You \nmove to board all those ships to keep the army from being resupplied.\n\nEpisode 39:  You mobilize in the field to keep the some enemy troops \nfrom crossing a river.\n\nEpisode 40:  You finally run into the bulk of the opposing army; \nunfortunately, the terrain is miserable for fighting.\n\nEpisodes 41: You leave 3/4 of your army to engage in a small skirmish \nwith the opposing army so that you can take 1/4 and sneak up on the \ncamp.\n\nEpisode 42:  With 1/4 of your army, you enter the last remaing enemy \ncamp throug the back and  you slaughter the remaining forces.\n\nEpisodes 43: You find a map to an abandoned mine and you take a small \npart of your army to explore it.  Upon, entering the mine, you find it \noccupied by barbarians.\n\nEpisode 44:  Upon going deeper into the mine, you find lots of gold, \nbarbarians, and orcs.\n\nEpisode 45:  Getting near the bottom of the mine, you find undead and \nmonsters that were sealed away.\n\nEpisode 46: A group of hired mercenaries try to steal the mine away \nfrom you.\n\nEpisode 47: Magic users have aligned to uproot you and your army.  \nTaking out the first wave isn&#39;t too bad, considering most of them are \nunexperienced.\n\nEpisode 48:  Fighting the second is horrible, because you keep running \ninto magical creatures.\n\nEpisode 49:  Your spies manage to find a major supply area for the \nmagic users.  You decide to demolish the spies and the forces inside.\n\nEpisode 50:  You finally nail down the last of the magic users to one \nlocation.  Unfortunately, their creations are still around.\n\nEpisodes 51-53: You decide to build a fort and in order to clear the \nland, you have to plow down some trees.  Unfortunately, the local \ndruids and elves don&#39;t quite like the idea.\n\nEpisodes 54-56: Sea pirates have attacked the harbor city and you rush \noff to defend it.\n\nEpisodes 57-60: Looking over your profits you realize your need a \nbigger population base to support your army.  You take a small group \nof your trusted men to sea to recruit people to live in your two \nmostly empty cities.\n\nEpisodes 61-63:  While looking for cleared land to build another fort, \nyou find a cleared patch of land completely surrounded forest and \ndecide to build your new fort there.  Unfortunately, there is \nsomething special about that patch of land.\n\nEpisode 64: While trying to build a look-out tower, you run into some \nresistence.\n\nEpisodes 65-67: You decide to drain a large swamp to convert into \ntraining grounds for your army.  Unfortunately, the swamp was \ninhabited.\n\nEpisode 66: Realizing you are barely making any money, you decide to \n&#39;liberate&#39; a small village from a nearby warlord.\n\nEpisodes 67-70: Unfortunately, you have go through the village \ncleaning out the warlord&#39;s forces who are holding a few villagers \nhostage.\n\nEpisode 71:  You hear about a nearby mine owned by the warlord and \ndecide to acquire it to put you financially ahead.\n\nEpisode 72:  You spot a fort owned by the warlord and decide it should \nbe yours.\n\nEpisodes 73-74: After hearing of travelers complaining about bandits, \nyou decide to set a trap to eliminate the threat.\n\nEpisode 74: The local druids and elves go after your newly captured \nfort.\n\nEpisodes 75-76:  From out of nowhere, slime start showing up in crop \nfields.\n\nEpisodes 77-80: The local warlord sends out men to attack you on \nmultiple fronts.\n\nEpisodes 81-83:  After looking over the map of areas you protect/own, \nyou notice a large section in the middle that you don&#39;t protect or \nown.  You decide to investigate it.\n\nEpisodes 84-85: A group of dangerous prisoners escape.  You have to \ntrack them down and recapture them.\n\nEpisodes 86-89: You decide to formally declare yourself monarch over \nall the lands you are protecting.  Unfortunately, a small group of \ncitizens aided by the some forces from the nearby warlord rise in \nprotest.  They manage to gain control of one of your mines and a fort. \n You have to drive them out.\n\nEpisode 90: You manage to raise a friendly competition between your \nmen and the warlord&#39;s men.\n\nEpisodes 91-92:  Mercenary mages afflict your territory, causing \nchaos.  Your only hope is to kill them and their creations.\n\nEpisode 93:  A plague of slime and faeries have appeared out of \nnowhere, invading your land.\n\nEpisodes 94-96:  Looking over the map of the entire island, you spot a \nsmall league of free cities controlled by a tyrant.  You decide to \nliberate the cities.\n\nEpisodes 97-100: You realize you could achieve control of 1/4 of the \nisland by taking out the warlord.  You decide to wage against him.  \nUnfortunately, he has managed to gather all your opponents together to \nhelp wage war against you.\n\n\n"}}