{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":137844973,"authorName":"imbanfsf &lt;imbanfsf@yahoo.com&gt;","from":"&quot;imbanfsf &lt;imbanfsf@...&gt;&quot; &lt;imbanfsf@...&gt;","profile":"imbanfsf","replyTo":"LIST","senderId":"OVrofj5CA69CccnZ-nsgrrBYs8XyWS2TFBKzAn4vst07-ZcE7UDSHu14p7inkp1tpl1940s-XUAbq2BDDkGgmkEXCLCDuFId0ZfiLR2S2rHimRTOFEvmRzxvlg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT : God-Characters Killing Each Other or My Guide to Dueling","postDate":"1045771262","msgId":1668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIzM2M1dSs0ZXYyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":1669,"prevInTime":1667,"nextInTime":1669,"topicId":1668,"numMessagesInTopic":3,"msgSnippet":"The only time I play Gladiator, really, is when a friend of mine is at my house and we are both playing it with the intent to put the character of the other to","rawEmail":"Return-Path: &lt;imbanfsf@...&gt;\r\nX-Sender: imbanfsf@...\r\nX-Apparently-To: gladiator@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 20 Feb 2003 20:15:14 -0000\r\nReceived: (qmail 36880 invoked from network); 20 Feb 2003 20:15:14 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m13.grp.scd.yahoo.com with QMQP; 20 Feb 2003 20:15:14 -0000\r\nReceived: from unknown (HELO n28.grp.scd.yahoo.com) (66.218.66.84)\n  by mta1.grp.scd.yahoo.com with SMTP; 20 Feb 2003 20:15:14 -0000\r\nReceived: from [66.218.67.184] by n28.grp.scd.yahoo.com with NNFMP; 20 Feb 2003 20:01:08 -0000\r\nDate: Thu, 20 Feb 2003 20:01:02 -0000\r\nTo: gladiator@yahoogroups.com\r\nSubject: OT : God-Characters Killing Each Other or My Guide to Dueling\r\nMessage-ID: &lt;b33c5u+4ev2@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 3655\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;imbanfsf &lt;imbanfsf@...&gt;&quot; &lt;imbanfsf@...&gt;\r\nX-Yahoo-Group-Post: member; u=137844973\r\nX-Yahoo-Profile: imbanfsf\r\n\r\nThe only time I play Gladiator, really, is when a friend of mine is \nat my house and we are both playing it with the intent to put the \ncharacter of the other to death.\n\nDuring these games, we&#39;ve used every character class known to \nGladiator on each other. Some of them are great duelists. Some of \nthem would be best served by surrendering before the battle begins.\n\nSoldiers - Usable for dueling, but tends to lose. Whirl is good for \nfearing the enemy if you&#39;re under artillery fire of some sort, but \ndoesn&#39;t really last long enough to do anything. Disarm requires you \nto get to melee range, which is unlikely in duels. However, \nBoomerang does massive damage at high levels and Charge lets you get \nclose enough that your boomerangs hit.\n\nBarbarian - If you give up and stand still, your death will be \nfaster.\n\nElf - If the map has deep, deep woods, you could hide in the woods \nand be really evil/cheap against most classes. Otherwise, Elves are \nonly good for setting up &quot;traps&quot; of huge amounts of rocks in maps \nwith enclosed areas.\n\nArcher - Much better in open maps, where exploding bolt can be used \nindiscriminately. In enclosed spaces, settle for Barrage. One of the \nmost powerful dueling classes, if not the most powerful.\n\nMage - Freeze Time if you&#39;re on Team 1 and your friend won&#39;t shout \nat you for it. Otherwise, Warp Space to do damage and Teleport if \nyou&#39;re about to eat 100 Exploding Bolts.\n\nArchMage - Their normal attack is insanely powerful. If you&#39;re NOT \nopposing a Thief or ArchMage, Summon Elemental to create a level-150 \nNPC Elemental is usually instant win. If elementals are coming after \nyou, use Mind Control, summon your own, and/or run. Don&#39;t try Mind \nControl against a single enemy, though - it will usually just get \nyou killed anyway.\n\nClerics - If there are high-level corpses sitting around on the map, \nfeel free to ressurect them. Against undead, I&#39;d assume you could \nTurn them. Otherwise, you have to hope for getting to melee range \nand using Mystic Mace.\n\nThief - At high levels, Cloak has nearly-infinite duration, which \nmakes it a lot harder for the enemy to find you. Poison Cloud can be \nused in enclosed areas to set up traps and Charm can turn those \nlevel-150 NPC Elementals against the enemy. Bombs, however, are a \nThief&#39;s main weapon, allowing one to do an absurd amount of damage \nif the enemy is caught in a bomb trap. My favorite dueling class.\n\nDruids - I&#39;ve heard from my friend that Grow Tree is also a death \nspell, but I&#39;ve never tried it. Protection is utterly useless \nagainst most forms of attack people will use. Summon, however, is \ngreat. It summons level-1 faeries that die in one hit... but if they \nhit the enemy, they&#39;re stunned forever.\n\nOrc - I suppose you could run at the enemy Howling. Fear explosive \nbolts.\n\nFire Elemental - Starburst and hope you aren&#39;t explosive-bolted to \ndeath.\n\nSkeletons - Barely better than barbarians, since their special lets \nthem dodge. Of course, sometimes they dodge into the line of fire. \nAlso, Turn Undead could be bad.\n\nGhost - Turn Undead could be bad, but all Ghosts can really do is \nfly around Howling and attacking the enemy. Fear explosive bolts.\n\nFaerie - Gets some points since its melee attack is permanent stun \nagainst high-level characters. Loses them for having nothing except \nmelee attacks and flight.\n\nSlime - If you&#39;re in the line of attack, killing you three times is \nusually just as easy as killing you once.\n\nAnd there you have it, my opinion on all of the classes of \nGladiator. Of course, all of these are biased towards high-level, \nhigh-stats duels and towards the other player being skilled at the \ngame.\n\n\n"}}