{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"crayner","from":"crayner &lt;crayner@...&gt;","replyTo":"LIST","senderId":"nUmYxFOoZxkGEakU7HZ1HqwLVa4VHvXZUFd6zjIz2ReWSmbkrazd705mR2tYnYwG34zQvuEKqG7qwtjtnfOEXx7cJQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [gladiator] Re: (strat/levels)","postDate":"962744035","msgId":188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NjI0RUUyLjcyM0Y4M0EzQHYtd2F2ZS5jb20+","referencesHeader":"PDhqcmRzMitsOGttQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":191,"prevInTime":187,"nextInTime":189,"topicId":188,"numMessagesInTopic":4,"msgSnippet":"... A lot of the characters are like that, they will engage the nearest enemy unless called on.  Instead of summoning defense, I find that my players tend to ","rawEmail":"Return-Path: &lt;crayner@...&gt;\r\nReceived: (qmail 590 invoked from network); 4 Jul 2000 20:54:45 -0000\r\nReceived: from unknown (10.1.10.26) by m3.onelist.org with QMQP; 4 Jul 2000 20:54:45 -0000\r\nReceived: from unknown (HELO slash.ab.videon.ca) (206.75.216.210) by mta1 with SMTP; 4 Jul 2000 20:54:45 -0000\r\nReceived: from v-wave.com (c8966-001.v-wave.com [24.108.44.55]) by slash.ab.videon.ca (8.9.2/8.9.2) with ESMTP id OAA13712 for &lt;gladiator@egroups.com&gt;; Tue, 4 Jul 2000 14:54:43 -0600 (MDT)\r\nMessage-ID: &lt;39624EE2.723F83A3@...&gt;\r\nDate: Tue, 04 Jul 2000 14:53:55 -0600\r\nX-Mailer: Mozilla 4.06 [en] (Win95; I)\r\nMIME-Version: 1.0\r\nTo: gladiator@egroups.com\r\nSubject: Re: [gladiator] Re: (strat/levels)\r\nReferences: &lt;8jrds2+l8km@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: crayner &lt;crayner@...&gt;\r\n\r\n\n\ndph of rules wrote:\n\n&gt; Here&#39;s something horrible.  You summon a defense and your clerics run\n&gt; away to fight other enemies.  Then, a cleric yells for help.  Whose\n&gt; fault is it that the cleric dies?  Or another thing.  I summon a\n&gt; defense, but my cleric insists on doing his own thing or worse yet,\n&gt; becomes frozen stiff.  I swear clerics need to be re-programmed to be\n&gt; more team players than individuals.  If enemy clerics would\n&gt; consentrate on protecting others, I would swear I would never be able\n&gt; to win.\n&gt;\n\nA lot of the characters are like that, they will engage the nearest enemy\nunless\ncalled on.  Instead of summoning defense, I find that my players tend to\ntune to\nthe consistency of constantly shouting YO as long as you&#39;re moving\nsomewhere,\nmuch better than summoned defense.\n\n\n&gt; I am trying to play through gladiator with 2 clerics and 2 mages.\n&gt; I&#39;ll let one become an archmage.  Smaller teams mean everyone gets\n&gt; upgrades quicker but have problems taking on large numbers at a time.\n&gt;  Larger teams means slower upgrades but fewer problems taking on\n&gt; large\n&gt; numbers at a time.  When I finish through with 2 clerics and 2 mages,\n&gt; I may try a team of 2 clerics, 2 mages, and 2 elves.\n\nCompletely true.  If you&#39;re fighting the Westwood elves for example, that\nlevel can become nearly overwhelming with a small team like you or I seem\nto be playing (I play 1 archmage and two clerics). When my friend\nintroduced me to this game (and I ended up registering within a few days)\nwe would hire plenty of virtual cannon fodder, treating soldiers more like\na temporary bonus for the level while we kept two main characters going.\nI think I was a druid and he was a cleric.\n\n&gt;\n&gt; My own problem with mages is that they frequently run out of magic\n&gt; power when engaging the enemy.  I really think that a mage should be\n&gt; treated as a spy unless the mage has a super high power level.\n&gt; Speaking of which, is there a intelligence level high enough for a\n&gt; mage to continously teleport without running out of magic power?\n\nMages are extremely hard to level at the lower levels, and in some cases\neven harder to keep alive and well.  If you are constantly &quot;Yo&quot;&#39;ing,\nyour computer-controlled mages will probably not teleport away, unless\nthey get into some kind of conflict.\n\nIn answer to your question: Yes, there is an intelligence level whereby\nmages can constantly teleport without ever running out of magical power.\nSimilarly, there is an intelligence level where they can never run out of\nmagical power while shooting their energy balls, but I think this is hella\nhigh for the archmage, because of the amount of magical power that\ntheir energy balls take off.  The mage has an easier time attaining this\nintelligence level.\n\n\n&gt; Does anyone know how to use a thief effectively?  I discovered that\n&gt; theives are usually more trouble than their worth because of a\n&gt; tendacy\n&gt; to create bombs if they are not busy.\n\nThieves are among my favorite characters -- partially because of their\nspeed,\nand partially because of their priceless taunt skill.  The problem with them\nis\nthat, like clerics, they aren&#39;t great if the computer is controlling them.\nThey\nare very good if you are controlling them and no how forever.  Here&#39;s one\nstrategy I like to use with early-on thieves (works insanely well in the\nslime\nlevel).\n\nDrop a bomb, or a cluster of bombs -- however many your intelligence allows\nyou to make.  Throw a few knives at a nearby foe and wait for him to attack\nyou.  Run backwards, standing past the bombs, and wait for your foe to walk\nover them.  If your foe is fast, you have to use the circle and strike\nmethod,\nwhich is a tad more difficult. :\n\nSay you are fighting a skeleton, or a group of them. They aren&#39;t very hardy,\nbut\nthey certainly are fast -- faster than your thief.  You aren&#39;t having a lot\nof luck\ndropping bombs and luring them into your trap, so you have to change your\nstrategy.  Bring some enemies to your cluster of bombs and begin circling\nthem,\nkeeping the circle small enough so that the enemy will stay on the bombs,\nturning occasionally to toss a bone at you.  Eventually, the bombs will go\noff\nand harm your enemy.\n\n---\n\nThis is the strategy that has made thieves one of the more useful classes\nfor me.\nThat and their ability to go invisible whenever you so please (so long as\nyou&#39;ve\ngot the intelligence to stay in those shadows) as well as a poison cloud\nthat can\nbe used similarly to bombs, except it does perpetual damage.  If you&#39;re used\nto\nusing a thief, and practice a lot, you can send him or her into the enemy&#39;s\nreproduction zones (with towers, bone piles, skeleton tents and whatnot) and\n\nbomb the bajeebers out of those guys, helping your team out considerably.\n\nBecause of their speed, you can also leave thieves alone if you&#39;re fighting\nslower enemies like elves.\n\n&gt;\n&gt; One small question:  is anyone tried to make an RP out of characters\n&gt; from this game?\n&gt;\n\nAn RP out of characters from this game?  Do you mean like pencil and paper\nroleplaying, or a RPG like the legend of zelda, using guys like Torvald and\nTroy?\n\n-Chris\n\n\n"}}