{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"-Tevildo.","from":"&quot;-Tevildo.&quot; &lt;Tevildo@...&gt;","replyTo":"LIST","senderId":"LkjFzDOw-JVZJrMNqrFhT2xzm7Y2dT6fc59oxR2aOGdgYTNcKmEEo-cTjlrthYCZ0QDw2KfY411qDNL7IQC89MA2rvnrlJ15","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [gladiator] Digest Number 97","postDate":"968165751","msgId":235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1NzBuRFMzT1VkT3FTZFFsZEIwMDAwNzZiNEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":234,"nextInTime":236,"topicId":235,"numMessagesInTopic":1,"msgSnippet":"Thanks for the critique; I REALLY appreciate feedback. If anyone else feels like posting their opinion of my stuff, I d welcome it. Now: as for what DPH said--","rawEmail":"Return-Path: &lt;tevildo@...&gt;\r\nReceived: (qmail 14451 invoked from network); 5 Sep 2000 17:37:14 -0000\r\nReceived: from unknown (10.1.10.27) by m3.onelist.org with QMQP; 5 Sep 2000 17:37:14 -0000\r\nReceived: from unknown (HELO hotmail.com) (209.185.241.57) by mta2 with SMTP; 5 Sep 2000 17:37:14 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC; Tue, 5 Sep 2000 07:55:52 -0700\r\nReceived: from 148.100.67.21 by lw3fd.law3.hotmail.msn.com with HTTP;\tTue, 05 Sep 2000 14:55:51 GMT\r\nTo: gladiator@egroups.com\r\nSubject: Re: [gladiator] Digest Number 97\r\nDate: Tue, 05 Sep 2000 10:55:51 EDT\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;F570nDS3OUdOqSdQldB000076b4@...&gt;\r\nX-OriginalArrivalTime: 05 Sep 2000 14:55:52.0237 (UTC) FILETIME=[62B3B5D0:01C01749]\r\nFrom: &quot;-Tevildo.&quot; &lt;Tevildo@...&gt;\r\n\r\nThanks for the critique; I REALLY appreciate feedback. If anyone else feels \nlike posting their opinion of my stuff, I&#39;d welcome it.\n\nNow: as for what DPH said--\n\n&gt;A couple of problems I noticed, though.\n\n&gt;One early scenario ended as soon as I defeated the last villain and I\n&gt;did not get a chance to clean up on the gold and silver.\n\nThis is intentional. If you don&#39;t put in an exit, it will automatically \nadvance you. I did this to blend the first two levels, and to be a bit \ntricky. Creel is slow enough that you can avoid him at first, and kill him \nwhen you have all the treasure.\n\n&gt;The forest was a little tight for my archmage to walk through (I had\n&gt;to summon an image of an elf to help me out), but that was probably\n&gt;the point.\n\nYes. The enemies are wimps in the Northern Forest; navigation was supposed \nto be the major concern. I tried it with a cleric as a test--hard but \ndoable. With just blobs, it&#39;s impossible, but that&#39;s not a viable team \nanywhere.\n\n&gt;Man, I love the extra large space to walk around for each scenario.\n&gt;If my archmage could not run so fast, it would make the some\n&gt;scenarios with generators interesting.\n\nYeah, Tactics is a nasty one if you don&#39;t have an archmage (chain lightning, \nsummon elemental) or an archer (exploding bolt). The main problem with these \nlevels is computer speed... my antique freezes up for several minutes when I \ndo a massive chain lightning. Speaking of Tactics, did anyone understand the \nLord Malrac reference, or am I wasting my time?\n\n&gt;Plotwise, it makes sense.\n\nI hope so. I didn&#39;t put TOO much thought into it, or else it would have \nturned into a bizarre Warcraft deal, and I think the emphasis of Gladiator \nwhould be solving levels, not figuring out the story. Still, a good plot is \nnice. I wish the Level 61 that came with the game functioned, as that seemed \nto have a good plot.\n\n&gt;The forest was a bit tight fit for getting through with an archmage.\n\nTeleport much?\n\n&gt;Having my teleporter marker blocked in the stairs and the labryinth\n&gt;was a little annoying.\n\nYeah. I found it a lot easier to just be an archer or soldier in the \nlabyrinth, and a ghost (to finish) on the stairs.\n\n&gt;I had to go back through twice on some levels because I missed an\n&gt;exit door (I got stuck and couldn&#39;t get to higher scenario numbers.  &gt;Of \n&gt;course, I missed exits on the normal levels too).\n\nDid you find the secret levels? The major challenge is finding Subterranea \nwithout going to the Garden of Golden Apples. You really need to keep your \neyes open for that one.\n\n&gt;How did you get that little trick where your NPCs die and\n&gt;automatically lose?\n\nLevel options. Hit asterisk on the scenario editor.\n\n&gt;Quality-wise:  you must have spent weeks designing the Labryinth and\n&gt;the stairs.  Other scenarios show that you spent time designing them.\n\nBelieve it or not, I did the labyrinth in two days, using a photograph of a \nmosaic which depicted the layout of the actual Labyrinth at Knossos. Fun. \nAll the names are from the myths of Theseus and the Minotaur too. Of course, \nI had to revise it later...\n\nThe stairs were a chore. It took me forever to figure out what I was going \nto do for &quot;up&quot; stairs to make them look different from &quot;down&quot; stairs. I&#39;m \nstill not happy with them the way they look, but I didn&#39;t want to mess with \nthe tiles. What did everyone think of my altered columns? I thought they \nturned out well.\n\n&gt;Hmm.  I liked your &#39;isolation&#39; level a lot and it gave me ideas on\n&gt;what not to do and what to do when designing such a level.\n\nWhich level was that?\n\n&gt;Overall, it was really enjoyable and playable.  Excellent work.\n\nThank you.\n                  -Tevildo, Prince of Cats.\n                     http://hotyellow98.com/tevildo/glad.html\n_________________________________________________________________________\nGet Your Private, Free E-mail from MSN Hotmail at http://www.hotmail.com.\n\nShare information about yourself, create your own public profile at \nhttp://profiles.msn.com.\n\n\n"}}