{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"-Tevildo.","from":"&quot;-Tevildo.&quot; &lt;Tevildo@...&gt;","replyTo":"LIST","senderId":"skC0kjBZV34p2FpZl3s9P4Pk0w7mwQn4GJ6C-IqdHuxrU3DPdpv93uk1VmSSiaxy-U95wenvCu5EnnAgTqdEye-mqjJeq3Q0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [gladiator] Digest Number 125","postDate":"973601771","msgId":320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMThJaDdqdHJTQnloMTMzdFkwMDAwYzQyN0Bob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":321,"prevInTime":319,"nextInTime":321,"topicId":320,"numMessagesInTopic":2,"msgSnippet":"When it comes to blazing firepower, I would put my master archmage or archer up against any multi-member team. The archer is a good example of balance--level","rawEmail":"Return-Path: &lt;tevildo@...&gt;\r\nX-Sender: tevildo@...\r\nX-Apparently-To: gladiator@egroups.com\r\nReceived: (EGP: mail-6_2_1); 7 Nov 2000 18:03:22 -0000\r\nReceived: (qmail 8282 invoked from network); 7 Nov 2000 18:03:21 -0000\r\nReceived: from unknown (10.1.10.142) by m2.onelist.org with QMQP; 7 Nov 2000 18:03:21 -0000\r\nReceived: from unknown (HELO hotmail.com) (209.185.241.118) by mta3 with SMTP; 7 Nov 2000 19:04:27 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC; Tue, 7 Nov 2000 04:56:12 -0800\r\nReceived: from 148.100.152.149 by lw3fd.law3.hotmail.msn.com with HTTP;\tTue, 07 Nov 2000 12:56:11 GMT\r\nTo: gladiator@egroups.com\r\nSubject: Re: [gladiator] Digest Number 125\r\nDate: Tue, 07 Nov 2000 07:56:11 EST\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;F118Ih7jtrSByh133tY0000c427@...&gt;\r\nX-OriginalArrivalTime: 07 Nov 2000 12:56:12.0258 (UTC) FILETIME=[1B201C20:01C048BA]\r\nFrom: &quot;-Tevildo.&quot; &lt;Tevildo@...&gt;\r\n\r\nWhen it comes to blazing firepower, I would put my master archmage or archer \nup against any multi-member team. The archer is a good example of \nbalance--level 36, but armoured to the point where his own exploding bolts \ndo very little damage to himself (well over 300). A cleric is a sitting duck \nfor a guy like this, as long as the controller keeps him out of magic mace \nrange. Mages and archmages can be taken out by a character half their level \nif they let him get into close combat. Teleporting isn&#39;t very effective, as \nyou can&#39;t target a location (unless you put a marker in a safe zone, behind \na door or wall). Still, an archer can easily slay someone through a wall or \ntwo, and an archmage&#39;s chain lightning is a scary prospect in cramped \nquarters. I haven&#39;t yet perfected the use of barbarians, but they have some \ndefinite possibilities, as do soldiers. They&#39;re just a bit slow for me.\n\nOn the topic of how hard is hard--I&#39;ve been able to beat every level of Tryx \nand DPH&#39;s released levels on slaughter with an archmage. They&#39;re both \noverpacked, so chain lightning is your best bet. TevFifty is mostly a \ncakewalk, as long as you finished the original 46, with the exceptions of \nThe Ocean, The Pyramid, Castle of 2.5 Peaks, and the final scenario. The \nothers are doable at Slaughter with a single good character. DPH, let&#39;s see \nif your archmage can beat The Ocean... in a normal level you would just blow \neverything up, summon an image of a cleric, have him raise ghosts, and use \nthem to search for the hidden areas.... but you can&#39;t summon an image over \nwater. Perhaps your chain lightning has enough range to hit the hidden \nstuff, perhaps not.\n\nThe Ten Inept Mages was an idea my friend Jonas passed over to me... he&#39;s \nquite a card, and a creative genius in his own right. All I did was stack a \nfew potions in ten location and plunk some level 1 mages and archmages right \nover them. Sometimes the morons teleport just as the level starts, leaving \nbehind their stash... making them sitting ducks. I used the same trick in \nthe Slime Corrals, so if you cheat and attack the Pet too soon, you&#39;ll just \nbe zapping an invulnerable blob for five minutes.\n\nXena fans out there--I was bored, and fooling around with Editor.exe, and \nended up making the elves throw Chakrams instead of rocks. It&#39;s really funny \nto watch them go bouncing off of walls and stuff, or if you give them \nsoldiers and make them return like frisbees... I&#39;ll put the file (rocks.pix) \nin our Egroups shared files, unzipped so you can see there&#39;s no virus, and \nif you want to use it just stick it in your Gladiator folder. To bring back \nthe default rocks, just delete the file.\n\nThat&#39;s all for today, folks... I&#39;ll be presenting Tom with a revised version \nof TevFifty pretty soon, to post on the Forgotten Sages site, but don&#39;t hold \nyour breath... I must have been drunk on life (or something) when I \nplaytested it. The teleporters AREN&#39;T foolproof, like I said they were; \nd&#39;oh! Of course, you can still get the original release at \nhttp://hotyellow98.com/tevildo/glad.html. Later.\n\n     -Tevildo, Prince of Cats.\n_________________________________________________________________________\nGet Your Private, Free E-mail from MSN Hotmail at http://www.hotmail.com.\n\nShare information about yourself, create your own public profile at \nhttp://profiles.msn.com.\n\n\n"}}