{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Tom Tildrum","from":"&quot;Tom Tildrum&quot; &lt;Tevildo@...&gt;","replyTo":"LIST","senderId":"sN6sTYxvEAvEoRPfZq_N1qlSm9aTxGiNXQGFqKnBD8QXo11dOj4eRjiDN4DaJl3W8SnlYDnAI1o5fAnaKsiD-wX9t-81axZOPp4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [gladiator] Digest Number 137","postDate":"976283288","msgId":341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxOTI4bVVBa2FxVHQ2V2RPcVMwMDAwOTg3NkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":342,"prevInTime":340,"nextInTime":342,"topicId":341,"numMessagesInTopic":2,"msgSnippet":"... Yes, the druids have good AI. Clerics... don t. The main reason to use them is to heal your other team members and raise ghosts, and they do neither under","rawEmail":"Return-Path: &lt;tevildo@...&gt;\r\nX-Sender: tevildo@...\r\nX-Apparently-To: gladiator@egroups.com\r\nReceived: (EGP: mail-6_3_1_3); 8 Dec 2000 21:30:10 -0000\r\nReceived: (qmail 93433 invoked from network); 8 Dec 2000 21:30:09 -0000\r\nReceived: from unknown (10.1.10.26) by l7.egroups.com with QMQP; 8 Dec 2000 21:30:09 -0000\r\nReceived: from unknown (HELO hotmail.com) (209.185.241.192) by mta1 with SMTP; 8 Dec 2000 21:30:09 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC; Fri, 8 Dec 2000 05:48:08 -0800\r\nReceived: from 148.100.152.150 by lw3fd.law3.hotmail.msn.com with HTTP;\tFri, 08 Dec 2000 13:48:08 GMT\r\nTo: gladiator@egroups.com\r\nSubject: Re: [gladiator] Digest Number 137\r\nDate: Fri, 08 Dec 2000 08:48:08 -0500\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;F1928mUAkaqTt6WdOqS00009876@...&gt;\r\nX-OriginalArrivalTime: 08 Dec 2000 13:48:08.0820 (UTC) FILETIME=[7F8BFB40:01C0611D]\r\nFrom: &quot;Tom Tildrum&quot; &lt;Tevildo@...&gt;\r\n\r\n&gt;I have seen enemy clerics raise the undead.  I have seen enemy druids\n&gt;use the spell of protection and summon faeries in my own scenarios.\n&gt;The only character I think that is severly deficient in its\n&gt;programming are slime.\n\nYes, the druids have good AI. Clerics... don&#39;t. The main reason to use them \nis to heal your other team members and raise ghosts, and they do neither \nunder the computer&#39;s control (at least, not on a regular basis). Slimes can \nbe nasty, if they&#39;re out in the open and have room to replicate. In your \n&quot;The Brag&quot;, if I accidentally blow the doors open and let the slimes out, \nthere&#39;s no way to win. I have to pick off the blobs with chain lightning or \nexploding bolts while they&#39;re still enclosed. Now, orc commanders... they \nhave no real purpose, and could use some further coding. I mean, why do they \nhave no abilities? That&#39;s crazy. How about... if an orc commander is within \nten squares of an orc, that orc gets his stats increased by 25%. Or \nsomething. Also, if towers had a close-range special, &quot;Boiling Oil&quot; or \nsomething, I think it would make for some fun times. Hehe... boiling oil.\n\n&gt;I had my entire team (1 mega powered archmage) mind controlled once\n&gt;and it lasted after the offending archmage was dead.  My team has &gt;been \n&gt;effected by enemy chain lightning in one of the original &gt;scenarios.  I \n&gt;have seen enemy mages freeze time REPEATEDLY in a &gt;certain one of the \n&gt;tevfifty and one of my own scenarios has been &gt;accused of fostering mages \n&gt;that repeatedly freeze time.\n\nIs it a gameplay problem? If there&#39;s something wrong with one of my levels, \nI&#39;ll fix it. I have to wonder if there are certain conditions under which \nthe enemies use more of their abilities than they normally do. I&#39;ve made \nlevels where the enemy mages use warp space a lot, and some where they just \ndon&#39;t. I can&#39;t figure out what triggers them to do this.\n\n&gt;Admittedly, I have not seen enemy archmages summon images or fire\n&gt;elementals.  However, those would be extremely to prove an enemy\n&gt;archmage would do so unless one created a scenario with 100% named\n&gt;characters and no monster generators.\n\nI don&#39;t know what you mean.\n\n&gt;I have no my problems with any other mega powered characters except\n&gt;faeries.  But faeries, ghosts, and sketelons are not likely to be\n&gt;around much once I complete this set and if you go through certain\n&gt;scenarios, you should understand my concern about facing faeries and\n&gt;ghosts.\n\nI never really liked ghosts. In all honesty, I prefer levels with normal \nhumans to play against, like Nilwyn Town.\n\n&gt;Well, in most of my scenarios, there will be no NPCs.  But, if I do\n&gt;have an NPC in my scenarios, the NPC will be sufficient to help you\n&gt;out in some problems.\n&gt;However, one slight note:  I have designed a scenario where a team\n&gt;composed entirely of clerics can NOT win [unless you are extremely\n&gt;lucky] and that scenario is on the main path.\n\nI think there are some tevfifty levels that a cleric would be useless on \n(like the Slime Machine). They&#39;re not good offensive characters, Mystic Mace \nor no Mystic Mace. If your character is fast and has a ranged attack, you \ncan pick off a cleric of any level with ease (and some time). That is, \nunless you let yourself get cornered, or kill yourself with your own attack \n(a la Exploding Bolt).\n\n&gt;Yes, I do realize some of my scenarios are not well suited for\n&gt;archers, but neither are certain ones of the tevfifty.\n\nYes, the Stairs are hell with an archer. Mages work best on the thin \npassages.\n\n&gt;I need opinions from more people on this subject of experience level\n&gt;15 and higher mages and archmages.\n\n_____________________________________________________________________________________\nGet more from the Web.  FREE MSN Explorer download : http://explorer.msn.com\n\n\n"}}