{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Bjørn Hansen","from":"=?iso-8859-1?Q?Bj=F8rn?= Hansen &lt;perfidious@...&gt;","replyTo":"LIST","senderId":"OX9RRUuShTKlNoBDB8E0PK0NQ53Lw5cY5oYHsdlsbsVtiPGp9KwkhMHitJFU77juAMeLDXpzdmv32N0CSDFuCPJehR0gxDYGfHhFiezlW7trr4ZQIH3ezF8KVtkJbpAxIA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [gladiator] and now introducing.....","postDate":"976438600","msgId":344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBMzM0NTQ4LjhDRjIyRDdEQHV2aWMuY2E+","referencesHeader":"PDAwMTIxMDAyMTA0NTU2LjIyNDAwQHdlYmEyLmluYW1lLm5ldD4="},"prevInTopic":343,"nextInTopic":345,"prevInTime":343,"nextInTime":345,"topicId":343,"numMessagesInTopic":3,"msgSnippet":"heh,  you know how I usually play(err used to anyway).  Hire a buttload of soldiers cause,  yea charge rules, and some clericks to keep them healthy, plus a","rawEmail":"Return-Path: &lt;bhansen@...&gt;\r\nX-Sender: bhansen@...\r\nX-Apparently-To: gladiator@egroups.com\r\nReceived: (EGP: mail-6_3_1_3); 10 Dec 2000 08:56:55 -0000\r\nReceived: (qmail 61094 invoked from network); 10 Dec 2000 08:56:55 -0000\r\nReceived: from unknown (10.1.10.27) by l9.egroups.com with QMQP; 10 Dec 2000 08:56:55 -0000\r\nReceived: from unknown (HELO cascara.UVic.CA) (142.104.5.28) by mta2 with SMTP; 10 Dec 2000 08:56:55 -0000\r\nReceived: from uvic.ca (h24-69-24-142.gv.shawcable.net [24.69.24.142]) by cascara.UVic.CA (8.10.1/8.10.1) with ESMTP id eBA8usC126316 for &lt;gladiator@egroups.com&gt;; Sun, 10 Dec 2000 00:56:54 -0800\r\nMessage-ID: &lt;3A334548.8CF22D7D@...&gt;\r\nDate: Sun, 10 Dec 2000 00:56:40 -0800\r\nX-Mailer: Mozilla 4.75 [en] (Win98; U)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: gladiator@egroups.com\r\nSubject: Re: [gladiator] and now introducing.....\r\nReferences: &lt;00121002104556.22400@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-From: =?iso-8859-1?Q?Bj=F8rn?= Hansen &lt;bhansen@...&gt;\r\nFrom: =?iso-8859-1?Q?Bj=F8rn?= Hansen &lt;perfidious@...&gt;\r\n\r\nheh,  you know how I usually play(err used to anyway).  Hire a buttload of soldiers cause,  yea charge rules, and some clericks to keep them healthy, plus a mage or 2.  Then I take my army and get my ass kicked a lot.  I end up keeping a couple soldiers that get burly, and my clerics usually do good at leveling up, and the mages\nmanage to stay alive by themselves fairly well while I am busy madly charging the enemy.  just have to keep hiring fresh cannon fodder . . . hmm this is probly why I never got a guy over like level 6. . It would be kinda nice to not have to keep &quot;yelling&quot; though so my guys didn&#39;t forget that I did a &quot;summon defence&quot; at the beginning.\nAs far as playing with 4 people, you gotta have a joystick or gamepad or something.  still can&#39;t see much though on that screen.\n\n4idlamo@... wrote:\n\n&gt; Man does not live with archmage/mage alone.\n&gt; First of all, an introduction (regardless of what my stupid email address is) I (think, but am i?) my name is Trahern, not 4idlamo.\n&gt; You spoke of writing fan fic; a concept which calls to the writers of the world to apply their abilities to popular games and shows such as Dragonball Z, Warcraft, Starcraft or in this case, Gladiator.\n&gt; As an English major at UofT and a gladiator fan I am more than happy to read/write such stories, however you will find that in a game as simple as Gladiator (sorry Tom) you need to do more than introduce some characters and fill the story with fight scenes.\n&gt;\n&gt; I tried building some gladiator levels, but my mom got mad at me when I tried to build a mage tower in my backyard. And the bombs did some serious damage to the walls. Funny that&#39;s not how it&#39;s supposed to happen.\n&gt;\n&gt; Why are we still stuck with a game that was last released in 1998? Time for some new versions. I couldn&#39;t even download Glad5, that .zip link has been broken forever.\n&gt; Why is the game called Gladiator at all? Don&#39;t most gladiators carry a sword? Oh yeah that&#39;s right, those guys with the white helmets have swords. But I just kick their ass with fire elementals and chain lightning.\n&gt; Come on guys you really have chars that are lvl 100 + ?\n&gt; Is there any point to hiring any class except an archer or mage? If the game is really that easy for you why don&#39;t you hire a team with some druids or thieves or orcs?\n&gt;\n&gt; &gt;From what I can tell (playing two player and or three player mode on slaughter with my brothers)\n&gt; Soldier: sword throw is ok, real power is in charge.\n&gt; cleric: heals the grunts, makes a base to fight off the pesky baddies.\n&gt; mage/archer: hides in base and shoots the enemies.\n&gt;\n&gt; Those are my three guys for the game. I can&#39;t cram a 4th guy at the keyboard, it locks up. :( And I&#39;d need a 60 inch screen to get a good view with the split screen action. Is there any other point to the characters out there? I mean i see these graphics of guys on my screen that aren&#39;t on my team, but who cares?\n&gt;\n&gt; (feel free to tell me how incorrect my judgement is cause it might be interesting to use these guys)\n&gt; Thief: bombs = useless; cloak = semi-useless; taunt = ???; gas cloud = unpredictable.\n&gt; Elf: wow. rocks. Enough said. and damn slow too.\n&gt; Orc: nice howl there pal. Try standing up to Dirk and his elves on lvl 1.\n&gt; Orc Capn: nice thief-dagger. You do anything else besides have that nice shoulder armor?\n&gt; Barbarian: interesting hammer. Where the boulders coming from? seems like a new soldier without the charge (aka the best move ever)\n&gt; Skeleton: like a soldier, but faster. wheres the charge?\n&gt; Ghost: way to make the bad guys run, bud.\n&gt; Pixie: (see druid) good for freezing really tough badguys maybe.\n&gt; Druid: lightning. nice range... and trees make good backbone for a base, but where&#39;s the heal? faeries are nice too, but pretty big (small) pushovers.\n&gt; Slime: always fun, but you usually get rocked before you can split enough times to fight back. and if your team isn&#39;t all slime, it will be soon when your other guys can&#39;t get on the field.\n&gt; Fire Elemental: well he LOOKS tough. Starburst is nice... I guess... Kind of lame game play if you ask me.\n&gt;\n&gt; Am I on the mark with this assessment? [Please don&#39;t kill me Tom I still think you guys rOOl] If the game is no longer challenging would it be sneaky to get more players and fight over who gets the $ upgrades? maybe play with a bigger team and share the $? Maybe play with characters that don&#39;t use teleport?\n&gt;\n&gt; You guys seemed relaxed and easy going, so I think I can assume a warmer welcome than I got in the ladies change-room. Yeah sure they did a lot of screaming but I figure that&#39;s the worst that you guys could do too. It would probably be in caps, not high pitched shreaks. And those high heels can really hurt your eyeballs, you know?\n&gt; Just some thoughts.\n&gt; -Trahern\n&gt;\n&gt; ---------------------------------------------------\n&gt; Get free personalized email at http://www.iname.com\n&gt;\n&gt;\n&gt; The Gladiator Mailing List\n\n\n"}}