{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Tom Tildrum","from":"&quot;Tom Tildrum&quot; &lt;Tevildo@...&gt;","replyTo":"LIST","senderId":"z7yDKTj1G-7_utRFfh-8bW9hW3aRuaHf20K2O5ULVwastveFaqVZNRhFd0jOzSbbpPHn2IVbW1eC4vupemKlNhbfTvcAJNL1Os8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: now introducing a new strain of influenza (j/k, of course)","postDate":"976544016","msgId":346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxOTZHTDVUeDZkb0xkSnJzNFEwMDAwYmExMEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":347,"prevInTime":345,"nextInTime":347,"topicId":346,"numMessagesInTopic":2,"msgSnippet":"","rawEmail":"Return-Path: &lt;tevildo@...&gt;\r\nX-Sender: tevildo@...\r\nX-Apparently-To: gladiator@egroups.com\r\nReceived: (EGP: mail-6_3_1_3); 11 Dec 2000 14:13:37 -0000\r\nReceived: (qmail 9464 invoked from network); 11 Dec 2000 14:13:36 -0000\r\nReceived: from unknown (10.1.10.26) by l9.egroups.com with QMQP; 11 Dec 2000 14:13:36 -0000\r\nReceived: from unknown (HELO hotmail.com) (209.185.241.196) by mta1 with SMTP; 11 Dec 2000 14:13:36 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC; Mon, 11 Dec 2000 06:13:36 -0800\r\nReceived: from 148.100.151.83 by lw3fd.law3.hotmail.msn.com with HTTP;\tMon, 11 Dec 2000 14:13:36 GMT\r\nTo: gladiator@egroups.com\r\nSubject: Re: now introducing a new strain of influenza (j/k, of course)\r\nDate: Mon, 11 Dec 2000 09:13:36 -0500\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;F196GL5Tx6doLdJrs4Q0000ba10@...&gt;\r\nX-OriginalArrivalTime: 11 Dec 2000 14:13:36.0372 (UTC) FILETIME=[8D472B40:01C0637C]\r\nFrom: &quot;Tom Tildrum&quot; &lt;Tevildo@...&gt;\r\n\r\n&lt;&lt;Man does not live with archmage/mage alone. First of all, an introduction \n(regardless of what my stupid email address is) I (think, but am i?) my name \nis Trahern, not 4idlamo. You spoke of writing fan fic; a concept which calls \nto the writers of the world to apply their abilities to popular games and \nshows such as Dragonball Z, Warcraft, Starcraft or in this case, Gladiator. \nAs an English major at UofT and a gladiator fan I am more than happy to \nread/write such stories, however you will find that in a game as simple as \nGladiator (sorry Tom) you need to do more than introduce some characters and \nfill the story with fight scenes.&gt;&gt;\n\nAt last! Someone other than Daniel or Ricky or Bjorn (sorry, can&#39;t pull off \nthe zany no-smoking-o-with-a-line-through-it) or myself posting to the list! \nTo jump right in... I was talking about real storytelling, not the sort of \ngarbage you might find at Fanfic.net (not that everything there is bad). \nGladiator certainly doesn&#39;t have the dramatic strength to carry a story by \nitself. Some games do. In the Two Towers MUD, there&#39;s so much background and \nso much going on that you can pull any old stuff out of your assassin and \nit&#39;ll fly (check out a totally crappy yet very popular Two Towers story I \nwrote at http://members.internettrash.com/smokers_guild/pitch.htm), but not \nhere. I was planning on writing a real human-interest story about Torvald \nand Neldwyn, with actual character development and *gasp* depth.\n\n&lt;&lt;I tried building some gladiator levels, but my mom got mad at me when I \ntried to build a mage tower in my backyard. And the bombs did some serious \ndamage to the walls. Funny that&#39;s not how it&#39;s supposed to happen.&gt;&gt;\n\nHey, I know how it is. In the Castle of Three Peaks, I threw a few too many \nthieves into a single room, and before I knew it, BOOM, it became the Castle \nof 2.5 Peaks.\n\n&lt;&lt;Why are we still stuck with a game that was last released in 1998? Time \nfor some new versions. I couldn&#39;t even download Glad5, that .zip link has \nbeen broken forever.&gt;&gt;\n\nIt&#39;s sad, quite sad, but Tom has explained that we can&#39;t really expect \nanything new from the Forgotten Sages... at least, not right now. Shayd has \na copy of the demo, but I&#39;ve never been able to make it work properly. \nShayd? Can we have the URL again? And while you&#39;re up, got any levels for \nus? (fingers crossed)\n\n&lt;&lt;Why is the game called Gladiator at all? Don&#39;t most gladiators carry a \nsword? Oh yeah that&#39;s right, those guys with the white helmets have swords. \nBut I just kick their ass with fire elementals and chain lightning.&gt;&gt;\n\nWell, not all gladiators carried swords. Some had spears, or tridents, or \nhooks or nets. So why can&#39;t I hire any Fighting Fishermen(TM)? This must be \nan oversight.\n\n&lt;&lt;Come on guys you really have chars that are lvl 100 + ? Is there any point \nto hiring any class except an archer or mage? If the game is really that \neasy for you why don&#39;t you hire a team with some druids or thieves or \norcs?&gt;&gt;\n\nIf the game is too easy, I play it on Slaughter, with a cripple-class (like \nthieves). I play-test everything with an archer on Slaughter... I&#39;m quite \ngood, so if I can&#39;t beat something there&#39;s a problem with it. The exception \nis, of course, save-the-NPC levels. On Slaughter, you&#39;re durned lucky if the \nNPCs last more than a minute. And if you&#39;re bored with the game, play some \nuser-created scenarios. Have you tried the TevFifty yet? \n[http://hotyellow98.com/tevildo/glad.html] I&#39;ve got some decent levels in \nthere, with a wide range of difficulty, and some actual *gasp* PLOT! And \nhave you made any yourself?\n\n&lt;&lt;From what I can tell (playing two player and or three player mode on \nslaughter with my brothers) Soldier: sword throw is ok, real power is in \ncharge. cleric: heals the grunts, makes a base to fight off the pesky \nbaddies. mage/archer: hides in base and shoots the enemies.&gt;&gt;\n\nMaybe the game is too easy because you&#39;re playing with three times the \nfirepower. Soldiers are pretty awful until you get some good boomerang \naction. Mystic mace for five squares in every direction! Disarm, on some \nenemies, makes them sitting ducks; on others it does nada. I&#39;ve never seen \nmuch need for the cleric&#39;s wall-building power. Waiting for the enemy to \ncome to you is a terrible way to play. On the other hand, most ghosts aren&#39;t \nstrong enough to break through and spook you...\n\n&lt;&lt;Is there any other point to the characters out there? I mean i see these \ngraphics of guys on my screen that aren&#39;t on my team, but who cares?&gt;&gt;\n\nWhat? I don&#39;t understand.\n\n&lt;&lt;(feel free to tell me how incorrect my judgement is cause it might be \ninteresting to use these guys) Thief: bombs = useless; cloak = semi-useless; \ntaunt = ???; gas cloud = unpredictable. Elf: wow. rocks. Enough said. and \ndamn slow too. Orc: nice howl there pal. Try standing up to Dirk and his \nelves on lvl 1. Orc Capn: nice thief-dagger. You do anything else besides \nhave that nice shoulder armor? Barbarian: interesting hammer. Where the \nboulders coming from? seems like a new soldier without the charge (aka the \nbest move ever) Skeleton: like a soldier, but faster. wheres the charge? \nGhost: way to make the bad guys run, bud. Pixie: (see druid) good for \nfreezing really tough badguys maybe. Druid: lightning. nice range... and \ntrees make good backbone for a base, but where&#39;s the heal? faeries are nice \ntoo, but pretty big (small) pushovers. Slime: always fun, but you usually \nget rocked before you can split enough times to fight back. and if your team \nisn&#39;t all slime, it will be soon when your other guys can&#39;t get on the \nfield. Fire Elemental: well he LOOKS tough. Starburst is nice... I guess... \nKind of lame game play if you ask me.&gt;&gt;\n\nOkay, from the top: bombs can pack a punch, in the right situation. In a \nstationary hand-to-hand fight they will only harm you. Cloak is good for \nplacing bombs and gas in the midst of a crowded room, grabbing keys, etc. In \none of those situations where all your enemies are standing still and the \nlevel is stalemated, Taunt can get people moving again. You can anchor a gas \ncloud by placing one edge on a wall. Make a bunch of these in a bottleneck \nor gateway, and taunt. You&#39;ll see the difference. A high-level elf has some \nnasty stones. I mean, NASTY stones. As in one hit can kill you. And they&#39;re \nhard to target when they hide in the woods. And if you take the time to find \na spot you can bounce rocks off of and keep them going perpetually, you have \nanother nice taunt-trap. Orcs... yeah, howl sucks. Eating bodies is \ninteresting, as you can heal without a cleric... but hey, howl sucks. I&#39;ve \nnever, in fact, seen it do anything noticeable. Orc Captain, as we were \ndiscussing a few days ago, is also crappy. I did a little test a while back \nin which I made a whole bunch of little rooms and placed an orc and orc \ncaptain in each and made them fight. At lower levels, the orc captains \nusually won (probably because of their fighting range), and at levels &gt;5 the \norcs usually won (perhaps because of a more efficient Howl). Just a little \nbit of info for you. Barbarians can do some real damage, but their lack of \nversatility makes them hard to play. The boulders, of course, are coming out \nof the ground. Would you prefer projectile vomit? Skeletons aren&#39;t strong \nenough to make a team work, and at higher levels you can make as many as you \nwant with a cleric. Same with ghosts. They&#39;re really nice for exploring and \npicking up hard-to-reach gold, but for that stuff you don&#39;t need a level 14. \nScaring by itself will never defeat anything, so if you use ghosts you&#39;d \nbetter have some soldiers hanging around.\nFairies are annoying to use. They don&#39;t really freeze anything long enough \nto kill it, and they die all over the place. They&#39;re good for doing \nscout-work, but not as good as ghosts. Druids can whip them up in a flash, \nand at low levels, so why hire them? Druids themselves are a bit on the weak \nside, and I don&#39;t see their powerful ranged attack making up for it. And the \ntrees... well, they suck, unless your enemy is too stupid to cut them down. \nSlimes are neatly impossible to play, as they keep losing levels, and are \nslow as anything. Going through the game as a slime is perhaps the ultimate \nchallenge (poke). Fire elementals lose their effectiveness after a while, so \nyou&#39;re better off just having an archie summon them.\n\n&lt;&lt;Am I on the mark with this assessment? [Please don&#39;t kill me Tom I still \nthink you guys rOOl] If the game is no longer challenging would it be sneaky \nto get more players and fight over who gets the $ upgrades? maybe play with \na bigger team and share the $? Maybe play with characters that don&#39;t use \nteleport?&gt;&gt;\n\nOr maybe we could stop making cheat-levels with a zillion gold just laying \nabout? (hack slash DPH microwave)\n\n&lt;&lt;You guys seemed relaxed and easy going, so I think I can assume a warmer \nwelcome than I got in the ladies change-room. Yeah sure they did a lot of \nscreaming but I figure that&#39;s the worst that you guys could do too. It would \nprobably be in caps, not high pitched shreaks. And those high heels can \nreally hurt your eyeballs, you know?\nJust some thoughts.     -Trahern&gt;&gt;\n\nMaybe you should keep those... tendencies... to yourself, like on the \nInternet. It&#39;s more private, and probably safer, to use those spy-cam \nfeeds--I mean, uh... nuts.\n\n&lt;&lt;heh,  you know how I usually play(err used to anyway).  Hire a buttload of \nsoldiers cause,  yea charge rules, and some clericks to keep them healthy, \nplus a mage or 2.  Then I take my army and get my ass kicked a lot.  I end \nup keeping a couple soldiers that get burly, and my clerics usually do good \nat leveling up, and the mages\n&gt;manage to stay alive by themselves fairly well while I am busy madly \n&gt;charging the enemy.  just have to keep hiring fresh cannon fodder . . . hmm \n&gt;this is probly why I never got a guy over like level 6. . It would be kinda \n&gt;nice to not have to keep &quot;yelling&quot; though so my guys didn&#39;t forget that I \n&gt;did a &quot;summon defence&quot; at the beginning.\nAs far as playing with 4 people, you gotta have a joystick or gamepad or \nsomething.  still can&#39;t see much though on that screen.&gt;&gt;\n\nHeh. The last time I tried for a real power team, my mage was the one who \nalways teleported into the wrong place and got killed (no matter how much \narmor I slapped on him). I believe there are ways to hook up more than one \nkeyboard to a single computer... the screen thing is still a problem. An \nonline version would kick some serious tail.\n\n&lt;&lt;However, the brag has certain problems with keeping enemies from fighting \neach other.  I have added more doors in attempt to keep the monsters from \npenetrating, but they insist on breaking through.&gt;&gt;\n\nWhat&#39;s wrong with just making them a single team? Or less than four teams? \nIf I use multiple armies, there&#39;s usually a very good reason. I have a \ntheory (untested so far) that, as doors are considered (in AI) to be \nweapons, a high-level door will be harder to bash open than a door at level \n1. I&#39;ve only made a few doors that I intended to have smashed open (in the \nSlime Machine, if you happened to be playing just orcs or blobs, the only \nway to win is to bash the door on that one H.G. well).\n\n&lt;&lt;The biggest defeciency (IMHO) with coding is what to the character\ndoes when it has max magic power.  If the scenario is completely\ndefeated, slime should not multiply, mages should not freeze time,\ndruids should not be growing trees, summoning faeries, etc.  On the\nother hand, if the scenario is not defeated the following should\noccur: slime should be growing/splitting [that would make slime truely\nscary] when they reach max magic power. Archmages should be summoning \nimages/fire elementals instead of leaving teleporter markers. Clerics should \nbe actively looking to raise undead and heal team\nmates. Druids should be summoning faeries.&gt;&gt;\n\nWell, that&#39;s assuming all your team members have total knowledge of what&#39;s \ngoing on in the battle. Roleplay still counts for something here. If what \nyou said actually happened, you&#39;d have all sorts of problems--a tremendous \nnumber of fairies stuck in enclosed spaces, for example, and a bunch of \nimages (with only 1 hp, mind you) running toward the battle front. Slimes \nalready split nearly as fast as they are able, but with a nice amount of \nrandomness thrown in. I agree the damn teleport markers should only be \nplaced for a very good reason (i.e. a stash of potions or the exit)... and \nwhen a mage dies, his marker should fade out and stop cluttering up the \nplace.\n\n&lt;&lt;IMHO, the most powerfull attacks are those in which you increase the\nnumber of your teammates.  Summoning images/fire elementals, raising\nundead, and summoning faeries are among the most powerfull attacks.&gt;&gt;\n\nSince when have fairies been a &quot;powerful attack&quot; and not a minor annoyance? \nTinkerhew, in &quot;A Bridge Too Evil&quot;, is the only semi-threatening fairy I&#39;ve \never seen, and no druid will ever summon a fairy like that. Yes, you&#39;re \nright about the others... except that THE most powerful attack is still \nChain Lightning. That is, unless you want to take the time and energy to \nsummon a hundred elementals. (Is it okay if I call them Balrogs from now on? \nThat just sounds cooler.)\n\n&lt;&lt;...However, I am using ghosts a lot in my scenarios on the ocean.&gt;&gt;\n\nGee, now where did you get the idea to stage scenarios on the ocean? *cough* \nA while back, there was a big uproar on this mailing list about a possible \ntournament, but with no real head-to-head action (and cheats) this was never \ncarried out. If this was an idea people wanted to pursue, I think the best \nway to pull it off would be to have everyone involved download the \nevaluation version and play it through. Then everyone could send in their \nsaved games and we could compare the total points. Of course, everyone would \nhave to promise to just use the evaluation levels, or we&#39;d be sitting there \nforever checking to make sure that no other levels were played. Comments?\n\n   -Tevildo, Prince of Cats.\n_____________________________________________________________________________________\nGet more from the Web.  FREE MSN Explorer download : http://explorer.msn.com\n\n\n"}}