{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"dph of rules","from":"&quot;dph of rules &quot; &lt;dph_of_rules@...&gt;","replyTo":"LIST","senderId":"0G_lRir1U7H6NCZhptyL_kgM3NjdpWDOAUuLTve84US0Ewqe0WIsAR0w7IXo0UR2JvO9jJgDL6i06Yc-n25LqpJKl4wQqO_gWDwMjPB-8A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: now introducing a new strain of influenza (j/k, of course)","postDate":"976579283","msgId":347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxM3BzaytxbnZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxOTZHTDVUeDZkb0xkSnJzNFEwMDAwYmExMEBob3RtYWlsLmNvbT4="},"prevInTopic":346,"nextInTopic":0,"prevInTime":346,"nextInTime":348,"topicId":346,"numMessagesInTopic":2,"msgSnippet":"... introduction ... my name ... which calls ... games and ... Gladiator. ... to ... simple as ... characters and ... pull off ... the list! ... sort of ... ","rawEmail":"Return-Path: &lt;dph_of_rules@...&gt;\r\nX-Sender: dph_of_rules@...\r\nX-Apparently-To: gladiator@egroups.com\r\nReceived: (EGP: mail-6_3_1_3); 12 Dec 2000 00:01:50 -0000\r\nReceived: (qmail 22837 invoked from network); 12 Dec 2000 00:01:50 -0000\r\nReceived: from unknown (10.1.10.26) by l9.egroups.com with QMQP; 12 Dec 2000 00:01:50 -0000\r\nReceived: from unknown (HELO jj.egroups.com) (10.1.10.91) by mta1 with SMTP; 12 Dec 2000 00:01:49 -0000\r\nX-eGroups-Return: dph_of_rules@...\r\nReceived: from [10.1.2.56] by jj.egroups.com with NNFMP; 12 Dec 2000 00:01:36 -0000\r\nDate: Tue, 12 Dec 2000 00:01:23 -0000\r\nTo: gladiator@egroups.com\r\nSubject: Re: now introducing a new strain of influenza (j/k, of course)\r\nMessage-ID: &lt;913psk+qnve@...&gt;\r\nIn-Reply-To: &lt;F196GL5Tx6doLdJrs4Q0000ba10@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 13907\r\nX-Mailer: eGroups Message Poster\r\nFrom: &quot;dph of rules &quot; &lt;dph_of_rules@...&gt;\r\n\r\n--- In gladiator@egroups.com, &quot;Tom Tildrum&quot; &lt;Tevildo@h...&gt; wrote:\n&gt; &lt;&lt;Man does not live with archmage/mage alone. First of all, an \nintroduction \n&gt; (regardless of what my stupid email address is) I (think, but am i?) \nmy name \n&gt; is Trahern, not 4idlamo. You spoke of writing fan fic; a concept \nwhich calls \n&gt; to the writers of the world to apply their abilities to popular \ngames and \n&gt; shows such as Dragonball Z, Warcraft, Starcraft or in this case, \nGladiator. \n&gt; As an English major at UofT and a gladiator fan I am more than happy \nto \n&gt; read/write such stories, however you will find that in a game as \nsimple as \n&gt; Gladiator (sorry Tom) you need to do more than introduce some \ncharacters and \n&gt; fill the story with fight scenes.&gt;&gt;\n&gt; \n&gt; At last! Someone other than Daniel or Ricky or Bjorn (sorry, can&#39;t \npull off \n&gt; the zany no-smoking-o-with-a-line-through-it) or myself posting to \nthe list! \n&gt; To jump right in... I was talking about real storytelling, not the \nsort of \n&gt; garbage you might find at Fanfic.net (not that everything there is \nbad). \n&gt; Gladiator certainly doesn&#39;t have the dramatic strength to carry a \nstory by \n&gt; itself. Some games do. In the Two Towers MUD, there&#39;s so much \nbackground and \n&gt; so much going on that you can pull any old stuff out of your \nassassin and \n&gt; it&#39;ll fly (check out a totally crappy yet very popular Two Towers \nstory I \n&gt; wrote at http://members.internettrash.com/smokers_guild/pitch.htm), \nbut not \n&gt; here. I was planning on writing a real human-interest story about \nTorvald \n&gt; and Neldwyn, with actual character development and *gasp* depth.\n&gt; \n&gt; &lt;&lt;I tried building some gladiator levels, but my mom got mad at me \nwhen I \n&gt; tried to build a mage tower in my backyard. And the bombs did some \nserious \n&gt; damage to the walls. Funny that&#39;s not how it&#39;s supposed to happen.&gt;&gt;\n&gt; \n&gt; Hey, I know how it is. In the Castle of Three Peaks, I threw a few \ntoo many \n&gt; thieves into a single room, and before I knew it, BOOM, it became \nthe Castle \n&gt; of 2.5 Peaks.\n&gt; \n&gt; &lt;&lt;Why are we still stuck with a game that was last released in 1998? \nTime \n&gt; for some new versions. I couldn&#39;t even download Glad5, that .zip \nlink has \n&gt; been broken forever.&gt;&gt;\n&gt; \n&gt; It&#39;s sad, quite sad, but Tom has explained that we can&#39;t really \nexpect \n&gt; anything new from the Forgotten Sages... at least, not right now. \nShayd has \n&gt; a copy of the demo, but I&#39;ve never been able to make it work \nproperly. \n&gt; Shayd? Can we have the URL again? And while you&#39;re up, got any \nlevels for \n&gt; us? (fingers crossed)\n&gt; \n&gt; &lt;&lt;Why is the game called Gladiator at all? Don&#39;t most gladiators \ncarry a \n&gt; sword? Oh yeah that&#39;s right, those guys with the white helmets have \nswords. \n&gt; But I just kick their ass with fire elementals and chain \nlightning.&gt;&gt;\n&gt; \n&gt; Well, not all gladiators carried swords. Some had spears, or \ntridents, or \n&gt; hooks or nets. So why can&#39;t I hire any Fighting Fishermen(TM)? This \nmust be \n&gt; an oversight.\n&gt; \n&gt; &lt;&lt;Come on guys you really have chars that are lvl 100 + ? Is there \nany point \n&gt; to hiring any class except an archer or mage? If the game is really \nthat \n&gt; easy for you why don&#39;t you hire a team with some druids or thieves \nor \n&gt; orcs?&gt;&gt;\n&gt; \n&gt; If the game is too easy, I play it on Slaughter, with a \ncripple-class (like \n&gt; thieves). I play-test everything with an archer on Slaughter... I&#39;m \nquite \n&gt; good, so if I can&#39;t beat something there&#39;s a problem with it. The \nexception \n&gt; is, of course, save-the-NPC levels. On Slaughter, you&#39;re durned \nlucky if the \n&gt; NPCs last more than a minute. And if you&#39;re bored with the game, \nplay some \n&gt; user-created scenarios. Have you tried the TevFifty yet? \n&gt; [http://hotyellow98.com/tevildo/glad.html] I&#39;ve got some decent \nlevels in \n&gt; there, with a wide range of difficulty, and some actual *gasp* PLOT! \nAnd \n&gt; have you made any yourself?\n&gt; \n&gt; &lt;&lt;From what I can tell (playing two player and or three player mode \non \n&gt; slaughter with my brothers) Soldier: sword throw is ok, real power \nis in \n&gt; charge. cleric: heals the grunts, makes a base to fight off the \npesky \n&gt; baddies. mage/archer: hides in base and shoots the enemies.&gt;&gt;\n&gt; \n&gt; Maybe the game is too easy because you&#39;re playing with three times \nthe \n&gt; firepower. Soldiers are pretty awful until you get some good \nboomerang \n&gt; action. Mystic mace for five squares in every direction! Disarm, on \nsome \n&gt; enemies, makes them sitting ducks; on others it does nada. I&#39;ve \nnever seen \n&gt; much need for the cleric&#39;s wall-building power. Waiting for the \nenemy to \n&gt; come to you is a terrible way to play. On the other hand, most \nghosts aren&#39;t \n&gt; strong enough to break through and spook you...\n&gt; \n&gt; &lt;&lt;Is there any other point to the characters out there? I mean i see \nthese \n&gt; graphics of guys on my screen that aren&#39;t on my team, but who \ncares?&gt;&gt;\n&gt; \n&gt; What? I don&#39;t understand.\n&gt; \n&gt; &lt;&lt;(feel free to tell me how incorrect my judgement is cause it might \nbe \n&gt; interesting to use these guys) Thief: bombs = useless; cloak = \nsemi-useless; \n&gt; taunt = ???; gas cloud = unpredictable. Elf: wow. rocks. Enough \nsaid. and \n&gt; damn slow too. Orc: nice howl there pal. Try standing up to Dirk and \nhis \n&gt; elves on lvl 1. Orc Capn: nice thief-dagger. You do anything else \nbesides \n&gt; have that nice shoulder armor? Barbarian: interesting hammer. Where \nthe \n&gt; boulders coming from? seems like a new soldier without the charge \n(aka the \n&gt; best move ever) Skeleton: like a soldier, but faster. wheres the \ncharge? \n&gt; Ghost: way to make the bad guys run, bud. Pixie: (see druid) good \nfor \n&gt; freezing really tough badguys maybe. Druid: lightning. nice range... \nand \n&gt; trees make good backbone for a base, but where&#39;s the heal? faeries \nare nice \n&gt; too, but pretty big (small) pushovers. Slime: always fun, but you \nusually \n&gt; get rocked before you can split enough times to fight back. and if \nyour team \n&gt; isn&#39;t all slime, it will be soon when your other guys can&#39;t get on \nthe \n&gt; field. Fire Elemental: well he LOOKS tough. Starburst is nice... I \nguess... \n&gt; Kind of lame game play if you ask me.&gt;&gt;\n&gt; \n&gt; Okay, from the top: bombs can pack a punch, in the right situation. \nIn a \n&gt; stationary hand-to-hand fight they will only harm you. Cloak is good \nfor \n&gt; placing bombs and gas in the midst of a crowded room, grabbing keys, \netc. In \n&gt; one of those situations where all your enemies are standing still \nand the \n&gt; level is stalemated, Taunt can get people moving again. You can \nanchor a gas \n&gt; cloud by placing one edge on a wall. Make a bunch of these in a \nbottleneck \n&gt; or gateway, and taunt. You&#39;ll see the difference. A high-level elf \nhas some \n&gt; nasty stones. I mean, NASTY stones. As in one hit can kill you. And \nthey&#39;re \n&gt; hard to target when they hide in the woods. And if you take the time \nto find \n&gt; a spot you can bounce rocks off of and keep them going perpetually, \nyou have \n&gt; another nice taunt-trap. Orcs... yeah, howl sucks. Eating bodies is \n&gt; interesting, as you can heal without a cleric... but hey, howl \nsucks. I&#39;ve \n&gt; never, in fact, seen it do anything noticeable. Orc Captain, as we \nwere \n&gt; discussing a few days ago, is also crappy. I did a little test a \nwhile back \n&gt; in which I made a whole bunch of little rooms and placed an orc and \norc \n&gt; captain in each and made them fight. At lower levels, the orc \ncaptains \n&gt; usually won (probably because of their fighting range), and at \nlevels &gt;5 the \n&gt; orcs usually won (perhaps because of a more efficient Howl). Just a \nlittle \n&gt; bit of info for you. Barbarians can do some real damage, but their \nlack of \n&gt; versatility makes them hard to play. The boulders, of course, are \ncoming out \n&gt; of the ground. Would you prefer projectile vomit? Skeletons aren&#39;t \nstrong \n&gt; enough to make a team work, and at higher levels you can make as \nmany as you \n&gt; want with a cleric. Same with ghosts. They&#39;re really nice for \nexploring and \n&gt; picking up hard-to-reach gold, but for that stuff you don&#39;t need a \nlevel 14. \n&gt; Scaring by itself will never defeat anything, so if you use ghosts \nyou&#39;d \n&gt; better have some soldiers hanging around.\n&gt; Fairies are annoying to use. They don&#39;t really freeze anything long \nenough \n&gt; to kill it, and they die all over the place. They&#39;re good for doing \n&gt; scout-work, but not as good as ghosts. Druids can whip them up in a \nflash, \n&gt; and at low levels, so why hire them? Druids themselves are a bit on \nthe weak \n&gt; side, and I don&#39;t see their powerful ranged attack making up for it. \nAnd the \n&gt; trees... well, they suck, unless your enemy is too stupid to cut \nthem down. \n&gt; Slimes are neatly impossible to play, as they keep losing levels, \nand are \n&gt; slow as anything. Going through the game as a slime is perhaps the \nultimate \n&gt; challenge (poke). Fire elementals lose their effectiveness after a \nwhile, so \n&gt; you&#39;re better off just having an archie summon them.\n&gt; \n&gt; &lt;&lt;Am I on the mark with this assessment? [Please don&#39;t kill me Tom I \nstill \n&gt; think you guys rOOl] If the game is no longer challenging would it \nbe sneaky \n&gt; to get more players and fight over who gets the $ upgrades? maybe \nplay with \n&gt; a bigger team and share the $? Maybe play with characters that don&#39;t \nuse \n&gt; teleport?&gt;&gt;\n&gt; \n&gt; Or maybe we could stop making cheat-levels with a zillion gold just \nlaying \n&gt; about? (hack slash DPH microwave)\n&gt; \n\nI have not quite gotten to the point of a zillion gold.  The best I \ndid was 1.2 billion, but that was for a personal level to save me time \nraising money to make mega characters.  I might have to take time to \nreach the maximum level number for gold.  I accidentl crossed over it \nand my gold was seriously weaker.  That scenario will NEVER be \nreleased with the rest of my scenarios.\n\n  All else has at least standard 1 million in gold/silver [except for \none that has no gold in it].  Trust me, by the time you get to the \nlast scenario, you might [emphasis: might] be able to pull off defeat \nagainst a certain scenario I created first.  That is the goal I am \nworking towards with my scenarios.\n\n&gt; &lt;&lt;However, the brag has certain problems with keeping enemies from \nfighting \n&gt; each other.  I have added more doors in attempt to keep the monsters \nfrom \n&gt; penetrating, but they insist on breaking through.&gt;&gt;\n&gt; \n&gt; What&#39;s wrong with just making them a single team? Or less than four \nteams?\n\nMy idea was you tackle a few (4-5) enemies at a time.  I might try to \nconsider the number of teams down to 2 and see if that helps the \nsituation.  The worst offenders of breaking down doors happen to be \nDRUIDS.  Go figure.\n\n  My own team is really stupid about NOT destroying enemy trees.  They \nwould go around it or turn around before destroying the damn trees.  I \nhave to personally remove enemy trees.  The only way they will \ndemolish trees is if there is a powerfull enemy protected by trees \n(that was an experiment to see what it would take for my own team \nmates to demolish trees).\n\n&gt; \nI agree the damn teleport markers should only \nbe \n&gt; placed for a very good reason (i.e. a stash of potions or the \nexit)... and \n&gt; when a mage dies, his marker should fade out and stop cluttering up \nthe \n&gt; place.\n\nI agree whole heartedly with that idea of teleporter markers \ndisappearing when the mage/archmage dies..\n&gt; \n&gt; &lt;&lt;IMHO, the most powerfull attacks are those in which you increase \nthe\n&gt; number of your teammates.  Summoning images/fire elementals, raising\n&gt; undead, and summoning faeries are among the most powerfull \nattacks.&gt;&gt;\n&gt; \n&gt; Since when have fairies been a &quot;powerful attack&quot; and not a minor \nannoyance? \n\nSimple, it&#39;s about numbers.  Sure faeries are killed easily, but that \nmight be what you need to take one or two enemies off your back for a \nmoment.  You have not seen the faeries I have created.  Invisible \nfaeries pose a problem.  But, the druid&#39;s spell of protection actually \ndoes more harm than good in that scenario.\n\nYes, \nyou&#39;re \n&gt; right about the others... except that THE most powerful attack is \nstill \n&gt; Chain Lightning. That is, unless you want to take the time and \nenergy to \n&gt; summon a hundred elementals. (Is it okay if I call them Balrogs from \nnow on? \n\nWho needs one hundred elementals?  I only need is maybe 2-3 elementals \nthat have unlimited magic power and health power.  Yes, it is possible \nto get those with a legitimate team NOW.\n\n&gt; &lt;&lt;...However, I am using ghosts a lot in my scenarios on the \nocean.&gt;&gt;\n&gt; \n&gt; Gee, now where did you get the idea to stage scenarios on the ocean? \n*cough*\n\nok, I give my credit to the tevfifty for doing it first.  However, my \nocean going scenarios can be [or will be able to be] beaten by a \nlegitimate team.  It might be an uphill battle but the first one gives \n you tools [NPCs] to help out.\n\n\n&gt; A while back, there was a big uproar on this mailing list about a \npossible \n&gt; tournament, but with no real head-to-head action (and cheats) this \nwas never \n&gt; carried out. If this was an idea people wanted to pursue, I think \nthe best \n&gt; way to pull it off would be to have everyone involved download the \n&gt; evaluation version and play it through. Then everyone could send in \ntheir \n&gt; saved games and we could compare the total points. Of course, \neveryone would \n&gt; have to promise to just use the evaluation levels, or we&#39;d be \nsitting there \n&gt; forever checking to make sure that no other levels were played. \nComments?\n\nThat would be the best bet.  Wait a minute, the game does keep track \nof what scenarios were played somehow for each team.  If someone from \nFSGames could look at the file, that person could check to see if \nanyone played any other scenarios.  The other thing would be is \nsomeone&#39;s total points was way above everyone else&#39;s.\n\nIn other news, I have one more scenario to complete in this cycle \nuntil I begin testing them with my 100% legitimate team.  That will \nmake 13 scenarios in this cycle, bringing me to a total of 22 \nscenarios.  But I emphasize: go through the tevfifty BEFORE trying to \ngo through my scenarios.\n\n\n"}}