{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"dph of rules","from":"&quot;dph of rules &quot; &lt;dph_of_rules@...&gt;","replyTo":"LIST","senderId":"IEu6w7c_NvC0qx-HIDBDQsXPzzcyWtkeq8ub1Nv_4QE_vWTtbewQWVQIzGgyVTKRj4ptUq9JTrqnuLGKC9WFD0j6U50ewJvhavfa9AMmoA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Save the NPCs; watch out for included levels","postDate":"976841358","msgId":351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxYnBxZStubnZrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYxNjFJaUdYaXg0QTJEcmVCQnMwMDAwMGFkNkBob3RtYWlsLmNvbT4="},"prevInTopic":350,"nextInTopic":0,"prevInTime":350,"nextInTime":352,"topicId":350,"numMessagesInTopic":2,"msgSnippet":"... difficulty rating ... seem to ... Yes, I have noticed that the difficulty level seems not to affect anything.  Perhaps, it was designed to par out extra","rawEmail":"Return-Path: &lt;dph_of_rules@...&gt;\r\nX-Sender: dph_of_rules@...\r\nX-Apparently-To: gladiator@egroups.com\r\nReceived: (EGP: mail-6_3_1_3); 15 Dec 2000 00:49:23 -0000\r\nReceived: (qmail 89835 invoked from network); 15 Dec 2000 00:49:23 -0000\r\nReceived: from unknown (10.1.10.27) by m8.onelist.org with QMQP; 15 Dec 2000 00:49:23 -0000\r\nReceived: from unknown (HELO jk.egroups.com) (10.1.10.92) by mta2 with SMTP; 15 Dec 2000 00:49:23 -0000\r\nX-eGroups-Return: dph_of_rules@...\r\nReceived: from [10.1.10.95] by jk.egroups.com with NNFMP; 15 Dec 2000 00:49:22 -0000\r\nDate: Fri, 15 Dec 2000 00:49:18 -0000\r\nTo: gladiator@egroups.com\r\nSubject: Re: Save the NPCs; watch out for included levels\r\nMessage-ID: &lt;91bpqe+nnvk@...&gt;\r\nIn-Reply-To: &lt;F161IiGXix4A2DreBBs00000ad6@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4211\r\nX-Mailer: eGroups Message Poster\r\nFrom: &quot;dph of rules &quot; &lt;dph_of_rules@...&gt;\r\n\r\n&gt;There&#39;s also a level \ndifficulty rating \n&gt; that you can specify, but I&#39;ve experimented with it and it doesn&#39;t \nseem to \n&gt; affect anything.\n\nYes, I have noticed that the difficulty level seems not to affect \nanything.  Perhaps, it was designed to par out extra points for harder \nlevels?\n\n&gt; \n&gt; &lt;&lt;Well I took both of your suggestions. First of all, I downloaded \nthe \n&gt; Tevfifty (right?) levels. Well they sure seem hard enough, however \nI&#39;m kind \n&gt; of disappointed with the lack of detail you put into the maps. \n\nIf you think the tevfifty are hard, hehehe, then my scenarios must be \nimpossible.  Of course, there might be an argument that my scenarios \nare impossible, but believe me when I say I playtested them with a \n100% legitimate team.  I also generally avoid freezing time when \nplaytesting so I have feel for what your team might be experiencing.\n\n\n&gt;And why do \n&gt; you choose hordes of weak lvl guys instead of some tough guys? \n(Don&#39;t take \n&gt; it personally I&#39;m just asking)&gt;&gt;\n\nThe problem with just a few tough guys is that it&#39;s really easy to go \nso high that the enemy could wipe out characters with 3 hits.  That \nwould not be fun.  In fact, one of my enemies is so powerfull that he \ncan open a door with 1 blow.\n\n&gt; \n&gt; I thought the maps were pretty good. I strive for realism (a tall \norder in \n&gt; this game), and what&#39;s more real than grass on the plains, trees in \nthe \n&gt; forests, water in the ocean, etc.? What else do you want? Let me \ntell you, \n&gt; some of those levels, like the Labyrinth, were damn hard to make, \nand I&#39;m \n&gt; justly proud of them. And as for the enemies... if I was an overlord \nand I \n&gt; wanted to wipe out an invading army, would I summon my soldiers and \nhave \n&gt; them attack as a unit, or would I get Jimmy Olsen&#39;s signal watch and \nsummon \n&gt; Superman to save the day? I can&#39;t think of many situations in which \na single \n&gt; person would be more effective in combat than an army. I take it you \nhaven&#39;t \n&gt; gotten very far yet... there are some NASTY enemy NPCs later on. \nDerrida is \n&gt; going to kill you at least twice, I guarantee it. Unless you&#39;re \nplaying on \n&gt; Skirmish with a DPH-style cadre of demigods, that is... and where&#39;s \nthe fun \n&gt; in that?\n\nWith my illegitimate teams, I almost never play on skirmism or battle \nlevels because it is no fun.  Demigods?  Heck, my best illegitimate \nteams can be wiped out on slaughter if I am not carefull.  In fact, I \nactually have fun summoning an image of a archer and using the archer \nto take out some of my own team.  I have accidently killed the \narchmage quite a few times.  This is kinda funny.  A ghost raised from \nthe dead by an image of a cleric was the only thing that &#39;surived&#39; \nwhen I accidently killed my mega archmage with an image of an archer.\n\n\nAs far as level numbers go, forget anything between 100 & 200.  The \nfirst few of 100 are used by Tyrx (as if anyone plays those scenarios) \nand the numbers left will be used by me.  Right now I am upto scenario \n136.  When all my team members reach a certain point, I will wrap up \nthe saga.  The main problem is bringing my mage upto the experience \nlevel I want.\n\nSpeaking of mages, in a mage versus faerie battle, I find it difficult \nto keep my mage from being frozen until the scenario ends.  I tried a \nstrategy of running around the faeries while using the &#39;warp space&#39; \nattack and it proved pretty good, except it left my mage nearly \ndrained of magic power (thankfully, I brought the intelligence level \nway up for mages).\n\nAs far as enemies go, once they reach level 12, they have all their \navailable attacks (indirectly, I am saying that point makes them so \nmuch tougher).  Also, remember: named enemies are harder to defeat  \nthan unnamed enemies.  Third, take all of my comments in stride with \nwhat kind of team I am using.  Right now, I am just getting around to \nhaving 100% level 10 enemies or higher (mainly out of caution).  It \ntook a lot of scenarios to build a team to the point of not having too \nmuch trouble with level 10s.  I will do good to end up with 100% level \n30s (except for  single enemy scenarios) on the main path.  Even then, \nit will not be against mages, achmages, and probably faeries (if I use \nthem by themselves).\n\n\n"}}