{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Tom Ricket","from":"Tom Ricket &lt;tricket@...&gt;","replyTo":"LIST","senderId":"kekGyOv5rofdSUXH3a14iB6NeHt6Y-10rgk6NPDF04SF5j_4qOZ3empcIYq3gMb5_uX-R0AoRR1x5a04WkHLLgMcjlo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Assorted things","postDate":"918705325","msgId":37,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3MjQ4LjE0LjM3Ljk1OTI3OTY3MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":38,"prevInTime":36,"nextInTime":38,"topicId":37,"numMessagesInTopic":4,"msgSnippet":"Hi, guys! Sorry if I ve been slow in participating in the discussions -- I was sick recently and let all my e-mail pile up, and I m just now getting through","rawEmail":"X-Digest-Num: 14\r\nMessage-ID: &lt;17248.14.37.959279670@...&gt;\r\nDate: Wed, 10 Feb 1999 22:55:25 -0500\r\nFrom: Tom Ricket &lt;tricket@...&gt;\r\nSubject: Assorted things\r\n\r\n\nHi, guys!\n\nSorry if I&#39;ve been slow in participating in the discussions -- I was sick\nrecently and let all my e-mail pile up, and I&#39;m just now getting through it.\n\nPersonally, I think the idea of a levels page is great! I have to admit that\nI&#39;ve got several sets of levels submitted to us that I&#39;ve been supposed to look\nat and, if they pass muster, put on our page, and I just haven&#39;t had the time\nrecently to do this :( If I can hand off the responsibility to anyone out\nthere, you can bet I&#39;d be happy to do it! :&gt; And of course we&#39;d be happy to\nlink to the page from the main Gladiator page.\n\nThe idea of a tournament sounded interesting as well, although it might be a\nlot of work. The biggest problem would probably be to make sure there was no\ncheating involved, which might mean using an honor system, or might require us\nto try to make a special version of the executable .. hmm .. I&#39;d have to think\nabout that. Even with a special version of the exe, you&#39;d still have people who\nwould use bugs that we haven&#39;t yet worked out (using a healer and thief in\ntandem, etc.) to gain experience.\n\n From David Storey:\n&gt;I would also like to point out that when I last checked the &quot;boost&quot;\n&gt;program you have available for download it outdated, it modifies the\n&gt;wrong locations in the file (I mucked around a bit and found some of\n&gt;the useful Hex locations, but I can&#39;t write a replacement program).\n\nWhoops; that&#39;s my fault. The author of Boost (not myself) had asked me to let\nhim know when or if we changed the file format, and I didn&#39;t do that .. and so\nyes, it&#39;s most likely doing some very STRANGE things now! I&#39;ll get in contact\nwith him, and see if he wants to update it, or if not, let me have the source\nso I could change it quickly on our end.\n\nNext topic:\n&gt;Also, I noticed there was a graphics editor included w/ the game.  Anyone \n&gt;ever tried creating new monsters?  Is it possible, or can you only modify \n&gt;existing creatures?\n\nThe graphics editor (editor.exe) was the initial (very crude, I admit) sprite\neditor that we made for Gladiator. While it&#39;s possible to modify existing\ngraphics (either background art, or the characters and monsters), you can&#39;t\nactually ADD anything, because we have that hard-coded into the game. So you\ncould, for example, make a better looking elf, or something similar, but you\ncouldn&#39;t add a new character type to the game.\n\n From Jeff:\n&gt;you can change what things look like. I edited a cleric once. I made it\n&gt;have a yellow ball on top of its staff\n\nSpeaking of which, if enough aspiring artists out there ever do want to play\nwith the editor and make different graphics for characters or backgrounds,\netc., that&#39;s another thing we could try to conglomerate into an &quot;alternate\ngraphics package&quot; if anyone&#39;s interested.\n\n--Tom\n\n\n \n\n---------------------------- \nTom Ricket \n&lt;mailto:tricket@...&gt;mailto:tricket@... \nForgotten Sages Games \n&lt;http://www.fsgames.com&gt;http://www.fsgames.com \n---------------------------- \n\n\n\n\n"}}