{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Daniel Paul Hightower","from":"&quot;Daniel Paul Hightower&quot; &lt;dph_of_rules@...&gt;","replyTo":"LIST","senderId":"YIBfjrv4HdRR_Hmyj7AfdIZhRMwfRWyaJdzwwXreB9ym3AUNvG8yhU5ORDeVpoIgrnnyZEDzmxgCGHlb3uzaa24evy9QadMjk0skJjIMyNAfWNh4BOlq","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Wish List Part 2","postDate":"992672821","msgId":580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlnZXU3bCs2YzIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PE1BQkJMS0pEREZMUElNTklMRkxHT0VER0NBQUEuVGhlTGVnZW5kYXJ5TGlnaHRAd29ybGRuZXQuYXR0Lm5ldD4="},"prevInTopic":559,"nextInTopic":583,"prevInTime":579,"nextInTime":581,"topicId":551,"numMessagesInTopic":10,"msgSnippet":"1st, let me re-evaluate the proposed new attacks of Fire Elemental: at experience level 4, giant fireball becames an attack.  Alternate of that would be giant","rawEmail":"Return-Path: &lt;dph_of_rules@...&gt;\r\nX-Sender: dph_of_rules@...\r\nX-Apparently-To: gladiator@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 16 Jun 2001 06:27:03 -0000\r\nReceived: (qmail 31580 invoked from network); 16 Jun 2001 06:27:03 -0000\r\nReceived: from unknown (10.1.10.26) by l9.egroups.com with QMQP; 16 Jun 2001 06:27:03 -0000\r\nReceived: from unknown (HELO ck.egroups.com) (10.1.2.83) by mta1 with SMTP; 16 Jun 2001 06:27:03 -0000\r\nX-eGroups-Return: dph_of_rules@...\r\nReceived: from [10.1.10.120] by ck.egroups.com with NNFMP; 16 Jun 2001 06:27:03 -0000\r\nDate: Sat, 16 Jun 2001 06:27:01 -0000\r\nTo: gladiator@yahoogroups.com\r\nSubject: Re: Wish List Part 2\r\nMessage-ID: &lt;9geu7l+6c23@...&gt;\r\nIn-Reply-To: &lt;MABBLKJDDFLPIMNILFLGOEDGCAAA.TheLegendaryLight@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5933\r\nX-Mailer: eGroups Message Poster\r\nFrom: &quot;Daniel Paul Hightower&quot; &lt;dph_of_rules@...&gt;\r\n\r\n1st, let me re-evaluate the proposed new attacks of Fire Elemental:\nat experience level 4, giant fireball becames an attack.  Alternate of \nthat would be giant starburst.  At exp level 6 (or maybe higher), \nsuicide attack becomes a possiblity.  The amount of energy put into \nthat single attack would be equal all the magic energy plus 1/10 the \nhealth converted into energy.  The idea behind the suicide attack is \nyou are facing comething lots more powerfull than any other team \nmember.  You would summon your fire elemental for the sole purpose of \ntaking the opponent out.  This would be usefull for some of my \n&#39;Torture&#39; scenarios.  In theory, you wouldn&#39;t/shouldn&#39;t let any of \nyour hired fire elementals use this attack.  To make it fair, a fire \nelemental has to be reasonable close to an enemy to use it.\n\n-- In gladiator@y..., &quot;Ricky Der&quot; &lt;TheLegendaryLight@w...&gt; wrote:\n&gt; Still, i think there should be some limits to chars that really \nshouldn&#39;t \n&gt; use it, and increase the less fortuante characters stats, i just see \nit\n&gt; boring sometimes to have max all stats on a mage, or cleric, or elf, \nthat\n&gt; could kill almost anything. there should be caps that increase per \nlv, just\n&gt; to make things interesting.\n\nActually, I would prefer dual dependance between exp level and other \nstats.  Exp level would only increase the potency of an attack, while \nanother stat would increase the range.\n \n&gt; I like the new fire elemental and slime recommendations, but don&#39;t \nmake them\n&gt; too powerful\n\nIdeally, you would want to use a pretty fast character (I confess to \nusing the Soldier&#39;s charge attack to help outrun opponents) or a \ncharacter with long range attacks (archer comes to mind) to attack \nanything with a suicide attack.\n\nI don&#39;t remember if I said this before, but I propose giving slime an \nattack called &#39;Digestion&#39;.  They would shoot digestive fluids at you.\n\nSkeletons - Has anyone ever tried to use tunnel attack with a skeleton \nof experience level 10 or higher?  It might as well be as bad as a \nmage&#39;s teleportation.  I would propose an alternate to tunnel called \n&#39;Underground&#39;.  The Skeleton would stay underground and walk around \neverywhere until you make him go above ground.  Why not allow 6 normal \n skeletons to combine and form a &#39;Giant Skeleton&#39;?\n\nGhost - I would propose an attack called &#39;Phase Out&#39;.  Basically, \nevery attack aimed at a ghost would just pass right through.  While \nthis attack is on, a ghost can use any magic potions, use teleporters, \neat food, etc.  A cleric could still kill the ghost using &#39;Turn \nUndead&#39;.  This attack would come at experience level 8.  At experience \nlevel 4 or higher, a ghost could &#39;Possess&#39; another character&#39;s body \nfor a brief period of time, provided the ghost has a higher experience \nlevel.  When the ghost leaves the body, it has perfect health and \nfully charged with magical energy, the extra health and energy would \ncome from the body of the possessed character.\n&gt; \n&gt; I got a good special attack for the mage, Invisibility, the mage can \ncast\n&gt; it, then dissapear, until the mage attacks something, while all \nundead\n&gt; creatures can have the special skill, see invis, where they can see.\n\nActually, this would be a great idea.  Letting all the undead see \nanything invisible.\n\nOrc Captain - ok, how about giving him the power to walk on water.  \nAlso, give him the proposed &quot;throw net&#39; attack which paralyzes an \nenemy.  Another attack for him would be &#39;Poison dart&#39;.  Once you get \nhim, you keep losing so many health points constantly until the \ncharacter dies or you finish the scenario.\n\nI think I have covered all of the hired character classes by now, \ngiving everyone 3 attacks.  Oh yea, thief.  I would propose adding \n&#39;Remote bomb&#39; as alternate to &#39;Drop Bomb&#39;.  You could drop off lots of \nremote bombs, but you would have to use a specific keystroke to denote \nthem all at once.\n\nI will have to work on coming off with more attacks for &#39;Giant \nSkeleton&#39; and &#39;Golem&#39;.\n \n&gt; This is another message sent by the infamous Ricky Der, The \nLegendary Light.\n&gt; \n&gt; -----Original Message-----\n&gt; From: Daniel Paul Hightower [mailto:dph_of_rules@y...]\n&gt; Sent: Monday, June 11, 2001 10:20 AM\n&gt; To: gladiator@y...\n&gt; Subject: [gladiator] Re: Wish List Part 2\n&gt; \n&gt; \n&gt; Rather than limit abilites of some characters, I would expand the\n&gt; abilites of the not-so-gifted ones.\n&gt; \n&gt; One of my personal pet peeves is the inability to use up magic \nenergy\n&gt; at times.  My mega-archmage has summoned elves that could stay in a\n&gt; forest and launch their most powerfull attacks without running out \nof\n&gt; magical energy.  Admittedly, that is advantageous, but trick \nshouldn&#39;t\n&gt; be.  The fire elementals summoned by my mega-archmage will never be\n&gt; able to run out of magical energy.  I forgot how high experience \nlevel\n&gt; you have to give a Golem for him not to run out of magical energy.  \nI\n&gt; would propose making the amount energy available for an attack \nrelated\n&gt; to the total max magical energy use available.  Effectively, this\n&gt; would make attacks stronger.\n&gt; \n&gt; This brings me to another point:  if a summoned image/firre \nelemental\n&gt; should exceed max limits for magical energy and/or health, the value\n&gt; displayed should be the max limit.\n&gt; \n&gt; I do have a proposed new attack for a fire elemental: suicide.  The\n&gt; fire elemental could convert all of its health and magical energy \ninto\n&gt; one super-powerfull starburst or all at a single direction, with\n&gt; flames continiung until all the energy is absorbed.  Suicide would\n&gt; only be available at experience level 4 or higher.  Use of this \nattack\n&gt; would have to be approved by the player for non-summoned fire\n&gt; elementals [Suicide would NOT drain health from an archmage if a\n&gt; summoned fire elemental decided to].  The fire elemental could \nrequest\n&gt; permission only once a minute.\n&gt; \n&gt; \n&gt; The Gladiator Mailing List\n&gt; \n&gt; \n&gt; Your use of Yahoo! Groups is subject to \nhttp://docs.yahoo.com/info/terms/\n\n\n"}}