{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Tom Tildrum","from":"&quot;Tom Tildrum&quot; &lt;Tevildo@...&gt;","replyTo":"LIST","senderId":"G-PvjhEOGQj6n5vbwRY2NfYM7v9f7Xa0Ga8EWr6L3Q7xk4j7SHcmML3OMMWcW9Ucb6VjMuDuNkdH4Q4U8WEYby_d2BWJhFVxlvI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Tristan, Trahern, and coding","postDate":"992958036","msgId":603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxODlLV2lHdFhzTDFjMDBnb1owMDAxMDZlZEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":604,"prevInTime":602,"nextInTime":604,"topicId":603,"numMessagesInTopic":6,"msgSnippet":"Why yes, Tristan, I ve dabbled with changing the tiles using Editor.exe. That particular experiment resulted in the pillars in the TevFifty and the ","rawEmail":"Return-Path: &lt;tevildo@...&gt;\r\nX-Sender: tevildo@...\r\nX-Apparently-To: gladiator@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 19 Jun 2001 13:40:39 -0000\r\nReceived: (qmail 44332 invoked from network); 19 Jun 2001 13:40:37 -0000\r\nReceived: from unknown (10.1.10.27) by l10.egroups.com with QMQP; 19 Jun 2001 13:40:37 -0000\r\nReceived: from unknown (HELO hotmail.com) (64.4.23.189) by mta2 with SMTP; 19 Jun 2001 13:40:36 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC; Tue, 19 Jun 2001 06:40:36 -0700\r\nReceived: from 148.100.67.21 by lw15fd.law15.hotmail.msn.com with HTTP;\tTue, 19 Jun 2001 13:40:36 GMT\r\nTo: gladiator@yahoogroups.com\r\nBcc: \r\nSubject: Tristan, Trahern, and coding\r\nDate: Tue, 19 Jun 2001 09:40:36 -0400\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;F189KWiGtXsL1c00goZ000106ed@...&gt;\r\nX-OriginalArrivalTime: 19 Jun 2001 13:40:36.0503 (UTC) FILETIME=[6BABA270:01C0F8C5]\r\nFrom: &quot;Tom Tildrum&quot; &lt;Tevildo@...&gt;\r\n\r\nWhy yes, Tristan, I&#39;ve dabbled with changing the tiles using Editor.exe. \nThat particular experiment resulted in the pillars in the TevFifty and the \nchakrams-for-rocks found in the group filespace. Everything else turned out \njust too weird to use.\n\nI have only one problem with your story, Trahern, and it isn&#39;t that you \nincluded me in it. Far from that, I welcome people to use me in a story, \neven if it is as a &quot;less interesting&quot; character, &quot;devoted to study&quot; (blech). \nThe dilemma lies in my name. It is spelled correctly once, at the very \nbeginning, and is then disfigured by a spurious &#39;l&#39; for the remainder of the \ntale. &quot;Telvildo&quot; is not a name; it&#39;s a travesty. I am Tevildo. Not Tevildo \nDronnor, for that matter... I have no surname. If anything, write it like \nthis:\n\n     &quot;Greetings,&quot; he said, sitting down opposite the elf by the campfire.\n     The hooded face remained lowered, staring into the flames.\n     &quot;My name is Tevildo,&quot; he said, trying to deepen his voice and sound \nimpassive, but at the same time remain friendly enough to spark \nconversation. They would be working together for some time. &quot;Otherwise known \nas the Prince of Cats.&quot;\n     The elf arced an eyebrow, but refrained from making comment.\n\nOr:\n\n     &quot;Greetings,&quot; he said, sitting down opposite the elf by the campfire.\n     The hooded face remained lowered, staring into the flames.\n     &quot;The mage?&quot; came a strange voice from the hood. It was a softer tone, \nit sounded almost feminine, but Tevildo had had experience with elves \nbefore. This one was male, although there were many who would not have known \nsuch.\n     &quot;Yes,&quot; he said.\n     &quot;Trahern Stombackh Faiyne,&quot; the elf said, lifting his head from the \nfire. He pulled the hood back from his head to reveal his elven features. \nThey were quite noticeable from a human&#39;s, of course. The long pointed ears, \nthe chiseled jawbones, long grey hair, and greyish eyes that all of the \nlios-alfar seemed to have. What caught his attention was the face paint. \nUnder his left eye, above his right, across both cheeks and temples, and the \nbase of his left jaw were patterns of black and dark green.\n     &quot;Or Trahern, for short. You have waited for some time now, wanting to \nwatch and observe before moving forward. I assume bad experiences in the \npast, yes?&quot;\n     &quot;Nothing I could not handle,&quot; he replied. &quot;My name is Tevildo.&quot; He \ntried to deepen his voice and sound impassive, while remaining friendly \nenough to spark conversation. They would be working together for some time.\n     &quot;Just...Tevildo?&quot; The elf seemed confused.\n     &quot;Er, yes. Is that a problem?&quot;\n     The elf was suddenly on his feet, without appearing to have moved, eyes \nablaze. &quot;Have you no loyalty to your clan?&quot; he exploded. &quot;No sense of \nobligation to your family&#39;s honour? Does your ancestry mean nothing to you?&quot;\n     Tevildo thought this over. &quot;No, not really,&quot; he finally admitted.\n     Trahern sat down again, apparently mollified. &quot;Oh,&quot; he said, and lapsed \nback into silence.\n\nI&#39;m just teasing, of course, but if there&#39;s one thing I can&#39;t stand it&#39;s \npeople mangling my name. There&#39;s a lot of history and lore behind it, in \nreal life as well as in story, and it&#39;s one of my most prized possessions. \nSo please watch the spelling, and don&#39;t tack anything extra onto it. Prince \nof Cats is fine, as it is the equivalent of Tevildo and has been attached to \nthe name since the fifth century.  Beyond that... no extras, please; no \nonion rings, no side of fries, no choice of beverage, and no Dronnor.\n\nIn actuality, I&#39;m really glad you wrote this, and I urge you to continue it. \nThe four of us against a powerhouse like Jakarta and his empire... I&#39;d say \nhe doesn&#39;t stand a chance. That is, if I&#39;m allowed my basic spells to lay \nwaste to his demonic hordes. There&#39;s a great potential here... will Tevildo \ngrow into an Archmage? Will Bjorn prove sneakier than Jakarta&#39;s man Ajax? \nHow will the brute force of Hightower match up against the power Lord Kelvin \nhas borrowed from the Children of the Sun? The (possibly) immortal elf \nTrahern and Molokai the Old--who&#39;s older? Inquiring minds want to know!\n\nI thought that my fanfic about Torvald would be the first Gladiator fanfic \never--guess I was wrong. It would have been finished long ago, but I \ncouldn&#39;t decide whether I wanted companion scenarios, and if I did then I&#39;d \nhave to hold off writing so that the two would gibe. At this point, I think \nthe scenarios would be superfluous, so when it does appear it will be prose \nalone.\n\nThis idea of writing fanfics for Gladiator brings up an interesting question \nof canon and fanon. An article I was reading a couple of days ago defined \nthe two: canon is material established in the official &quot;corpus&quot;: here the \nbasic Gladiator set of 1 through 45, plus the handful of multi-team \nscenarios around 300 that really only mention Lord Malrac, plus a couple \nfragmentary scenarios from Beyond Freedom. Not too much to work from. It \ncould be proposed that since the Tryxian Chronicles appear on the website, \nthat they are endorsed as part of the official story line. God, I hope not. \n&quot;Fanon&quot; is what is created by the fans, a substitute or supporting body \nthat, while not authoritative, adds to the depth and enjoyability. This \nwould be all the fan-created stuff, both in stories and scenarios. I think, \nif we are to be creating new material, then perhaps our fanon should become \npart of the canon itself. After all, if the plans for the new scenario \neditor work out, then in a way we are the new Forgotten Sages, and as such \nwould have some creative control over the Gladiator stuff in general. What I \nwant to know is why we need a new editor. The only problems I have with the \nold two is that I can&#39;t use a wide range of punctuation in the text. Period, \ncomma, apostrophe. That&#39;s it. Enough to drive a writer insane, I tell you... \nIf I could access my oh-so-beloved quotation marks, exclamation points, \nquestion marks, parentheses, dashes, colons, semicolons, and ampersands, \nthen I&#39;d be happier than a pig in slop. Everything else I can do, and \neveryone on the list can figure it out with a little practice. Now, if some \nfella was talking of applying his coding skills to the completion of Beyond \nFreedom, I&#39;d be behind him one hundred percent. I&#39;d help out, to the best of \nmy ability, and plug away at new scenario design as fast as my \nkeyboard-ravaged fingers could manage. Not to rain on anyone&#39;s parade, but \nit seems to me that people are getting ready to invest a whole hell of a lot \nof time to a slightly unnecessary and probably unpopular project, when it is \nin our grasp to create something as nifty and stable as Warcraft II. So: if \nwe have coders and time and space and permission, why are we not going for \nthe gold?\n\nSorry about the verbosity, folks, but I just finished reading Dalton \nTrumbo&#39;s &quot;Johnny Got His Gun&quot;... and being unwilling to communicate is just \nas bad as being unable to communicate, like the poor guy in the story... So \nwrite, shout, spray-paint your tag all over the city, bludgeon a politician \nin front of his horrified colleagues, or otherwise raise a ruckus and make \nyourself heard. If you don&#39;t have anything to say that&#39;s worth beating a \npolitician over, then chances are you&#39;re also a politician. Ta.\n     -Tevildo, Still Riding his Literary Intoxication.\n_________________________________________________________________\nGet your FREE download of MSN Explorer at http://explorer.msn.com\n\n\n"}}