{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Bjørn Hansen","from":"=?iso-8859-1?Q?Bj=F8rn?= Hansen &lt;perfidious@...&gt;","replyTo":"LIST","senderId":"MCszXvd6Hp_YLA-RCT8br9jm_zs-p3O4kTr0v-QWEePQ_mAtKOiVxFDPXw2dQdze9Rilegcn-S4PZ84_vujL7rApAm7H0XMZ8Trkj5weY7XJNdZqmF2EYwW5AiUSlwhbwg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [gladiator] Tristan, Trahern, and coding","postDate":"992996900","msgId":612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMkZFRTI0LkExOEQ5Njk5QHV2aWMuY2E+","referencesHeader":"PEYxODlLV2lHdFhzTDFjMDBnb1owMDAxMDZlZEBob3RtYWlsLmNvbT4gPDAwMTEwMWMwZjhkMiQ3NzllZjJhMCQ4ZmJmMjBjYkBwZW50aXVtNjAwPg=="},"prevInTopic":608,"nextInTopic":613,"prevInTime":611,"nextInTime":613,"topicId":603,"numMessagesInTopic":6,"msgSnippet":"I m mostly interested in doing the editor project because it would be interesting and I ve never done any windows programming before but I ve been meaning to","rawEmail":"Return-Path: &lt;bhansen@...&gt;\r\nX-Sender: bhansen@...\r\nX-Apparently-To: gladiator@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 20 Jun 2001 00:28:45 -0000\r\nReceived: (qmail 40836 invoked from network); 20 Jun 2001 00:28:45 -0000\r\nReceived: from unknown (10.1.10.26) by l8.egroups.com with QMQP; 20 Jun 2001 00:28:45 -0000\r\nReceived: from unknown (HELO cascara.UVic.CA) (142.104.5.28) by mta1 with SMTP; 20 Jun 2001 00:28:45 -0000\r\nReceived: from uvic.ca (145-pm3.hom.alaska.net [209.112.162.145]) by cascara.UVic.CA (8.11.3/8.11.3) with ESMTP id f5K0SgQ212242 for &lt;gladiator@yahoogroups.com&gt;; Tue, 19 Jun 2001 17:28:42 -0700\r\nMessage-ID: &lt;3B2FEE24.A18D9699@...&gt;\r\nDate: Tue, 19 Jun 2001 16:28:20 -0800\r\nX-Mailer: Mozilla 4.75 [en] (Win98; U)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: gladiator@yahoogroups.com\r\nSubject: Re: [gladiator] Tristan, Trahern, and coding\r\nReferences: &lt;F189KWiGtXsL1c00goZ000106ed@...&gt; &lt;001101c0f8d2$779ef2a0$8fbf20cb@pentium600&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-From: =?iso-8859-1?Q?Bj=F8rn?= Hansen &lt;bhansen@...&gt;\r\nFrom: =?iso-8859-1?Q?Bj=F8rn?= Hansen &lt;perfidious@...&gt;\r\n\r\nI&#39;m mostly interested in doing the editor project because it would be\ninteresting and I&#39;ve never done any windows programming before but I&#39;ve\nbeen meaning to learn and this seemed like a good way.  BTW, I played\naround with the Borland C++ builder command line tools and successfully\ncompiled a couple of win32 apps.  I also found a really cool free IDE\nthat works with both the Borland C++ builder tools and the GNU compiler\n(using cygwin or another windows port).  It&#39;s called vide.  So if no one\nalready has a favorite windows compiler, I guess we might as well use\nthat one.  \n\tWhat Deathifier said about why we aren&#39;t talking about going for a \nreal game is pretty much what I was thinking too.  The editor seems like\na much more managable project, especially since we have all the file\nformats.  I was also thinking the other day that once we have the editor\nif it worked out really well we might go for writing a new game that\nuses the files the editor produces (with some tweaking perhaps). \n\tSo Tevildo is right, we don&#39;t &quot;need&quot; a new editor, but having one that\nencapsulates the features of both the ones that come with the game, and\nis easier to use will hopefully encourage more people to be creative and\nmake stuff.  Plus, since it&#39;ll be open source, if you are frustrated\nthat you can&#39;t do something (like use all of the punctuation), then\nhopefully someone can add whatever feature without too much hassle(we\nhope).  Now, if only we had someone to lead the project :). . . \n\nDeathifier wrote:\n&gt; \n&gt; Heya,\n&gt; \n&gt; &lt;Skip parts about fanfic, I do agree that the spelling of names should be\n&gt; kept right though&gt;\n&gt; \n&gt; &gt; After all, if the plans for the new scenario\n&gt; &gt; editor work out, then in a way we are the new Forgotten Sages, and as such\n&gt; &gt; would have some creative control over the Gladiator stuff in general. What\n&gt; I\n&gt; &gt; want to know is why we need a new editor.\n&gt; \n&gt; Well I belive the purpose of the new editor is simply to make it simpler to\n&gt; use and provide extra features.\n&gt; Everything may well be possible with the existing editors, and from the\n&gt; feature list I&#39;ve got we are not actually adding much extra, however the\n&gt; thing is there are 2 files, their interface requires a lot of time to learn\n&gt; and there are a collection of things that can be done to speed up scenario\n&gt; creation.\n&gt; \n&gt; If the interface was easier to use then people that thought &quot;Hey it&#39;d be\n&gt; cool to write a scenario about blah blah blah...&quot; could fire it up, follow a\n&gt; couple of tutorials and experiment and produce something.\n&gt; The time-saving features mean that more experienced people can produce more\n&gt; faster, can afford to make more mistakes, and can update their scenarios,\n&gt; and don&#39;t have to worry so much about (re-)numbering - which, as I gather,\n&gt; is rather painful and time-consuming to do at the moment.\n&gt; \n&gt; &gt; The only problems I have with the\n&gt; &gt; old two is that I can&#39;t use a wide range of punctuation in the text.\n&gt; Period,\n&gt; &gt; comma, apostrophe. That&#39;s it. Enough to drive a writer insane, I tell\n&gt; you...\n&gt; Is this an editor limitation or a game limitation?  It seems odd you can&#39;t\n&gt; use any character you want but there may be restrictions in the game itself\n&gt; :)\n&gt; If theres no in-game limitations then I&#39;ll add these to the feature list.\n&gt; BTW - Since we have the scenario file format you may actually be able to\n&gt; directly edit the files, find the string/s, and stick your punctuation in :)\n&gt; \n&gt; &gt; If I could access my oh-so-beloved quotation marks, exclamation points,\n&gt; &gt; question marks, parentheses, dashes, colons, semicolons, and ampersands,\n&gt; &gt; then I&#39;d be happier than a pig in slop. Everything else I can do, and\n&gt; &gt; everyone on the list can figure it out with a little practice.\n&gt; True, but not everyone has, or wants, to spend the time to learn it, and it\n&gt; serves as a rather large &#39;entry-barrier&#39; to new scenario designers.\n&gt; After all, my total experience with it is opening it up, pressing some\n&gt; buttons, messing the screen up, wondering why it was rather hard to use, and\n&gt; exiting :)\n&gt; Guess I&#39;m too used to the Warcraft 2 and Starcraft editors...\n&gt; \n&gt; &gt; Now, if some\n&gt; &gt; fella was talking of applying his coding skills to the completion of\n&gt; Beyond\n&gt; &gt; Freedom, I&#39;d be behind him one hundred percent. I&#39;d help out, to the best\n&gt; of\n&gt; &gt; my ability, and plug away at new scenario design as fast as my\n&gt; &gt; keyboard-ravaged fingers could manage. Not to rain on anyone&#39;s parade, but\n&gt; &gt; it seems to me that people are getting ready to invest a whole hell of a\n&gt; lot\n&gt; &gt; of time to a slightly unnecessary and probably unpopular project, when it\n&gt; is\n&gt; &gt; in our grasp to create something as nifty and stable as Warcraft II. So:\n&gt; if\n&gt; &gt; we have coders and time and space and permission, why are we not going for\n&gt; &gt; the gold?\n&gt; There&#39;s a couple of problems with going directly for something like Beyond\n&gt; Freedom.\n&gt; a)  We don&#39;t have permission, there may be real legal barriers to getting\n&gt; permission (though I doubt they have any publishing agreements yet), FS may\n&gt; want to finish it at some point, they may not want to release the code, etc,\n&gt; etc.\n&gt; b)  We don&#39;t seem to have a top-notch set of coders here, games are large\n&gt; complicated things and the existing code has to be analysed as well, which\n&gt; involves knowledge of whatever graphics subsystem they were using (I think\n&gt; it might be directX, but Dependancy Walker is no longer on this machine so I\n&gt; can&#39;t check...will do that tomorrow) along with just general knowledge.\n&gt; c)  We also have no idea how we will work as a team, if it will work at all,\n&gt; or how any of this is going to turn out - nobody yet has volunteered to lead\n&gt; the project, so jumping to something big would not be very wise :)\n&gt; \n&gt; What you will probably find is once the scenario editor is built we can move\n&gt; to other things.\n&gt; All the above problems then become solved (aside from permission) and we\n&gt; also have something to demonstrate to FS to show what we can do.  Perhaps\n&gt; then we can move onto Beyond Freedom if we are allowed, and even though it\n&gt; would still be a huge task we would be much better equiped to carry it out\n&gt; :)\n&gt; \n&gt; Anyways those are just my thoughts, and it&#39;s 1am so they may not be entirely\n&gt; coherant.\n&gt; Of course, if a big bunch of people would rather do Beyond Freedom then I\n&gt; can&#39;t stop it, and I would still help with it, I&#39;m just trying to get across\n&gt; that the technique for learning to program &quot;Start with something small and\n&gt; work your way up&quot; definitely applies to this situation.  I don&#39;t know what\n&gt; experience people on the group have with game design and development and to\n&gt; what extent they can support/rebuff my comments however I&#39;ve done more than\n&gt; a little work - the most major of which is not visible on my site simply\n&gt; because I got a small way into it and found that I&#39;d need a lot more\n&gt; knowledge and a lot more time to do it (essence of the game was a\n&gt; multiplayer online RPG), and even some of my smaller ideas have fallen over\n&gt; themselves - I aim too high :)\n&gt; \n&gt; Ah well, I&#39;m off to get some sleep, sleep is gooood.\n&gt; \n&gt; Cya&#39;s,\n&gt; Deathifier\n&gt; - Who didn&#39;t proof read this like he really should have :)\n&gt; \n&gt; The Gladiator Mailing List\n&gt; \n&gt; \n&gt; Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n"}}